doc/comdb-notes-ru.org
### -*- mode: org; -*-
#+STARTUP: hidestars #+STARTUP: odd #+STARTUP: logdone #+STARTUP: nofninline
#+STYLE: <link rel="stylesheet" type="text/css" href="style.css" />
#+OPTIONS: H:4

           COMMON-DB: отладчик для кристаллов семейства Мультикор
#+BEGIN_CENTER
Документация пользователя \\
\\
#+BEGIN: block-update-time :format "%B %d, %Y, %H:%M"
January 11, 2010, 19:29
#+END:
#+END_CENTER

* Введение

Отладчик COMMON-DB (сокращённо "comdb") – программируемая среда
обеспечивающая доступ к базовым аппаратным средствам отладки (OnCD)
процессоров семейства Elvees Multicore.  Доступ к OnCD осуществляется
через внешний порт соответствующий стандарту JTAG (IEEE 1149.1).
В свою очередь, доступ к порту JTAG осуществляется с помощью двух
вариантов адаптера, сообщающихся с PC посредством EPP (параллельного
порта) или USB.

Отладчик предоставляет ограниченную совместимость с основным множеством
команд отладчика MDB.

Программируемость отладчика достигается ввиду его реализации на
ЯВУ (языке высокого уровня) ANSI Common Lisp (ANSI INCITS 226-1994),
позволяющему органичное расширение уже скомпилированных приложений,
а также включающему богатую, динамичную среду исполнения, и открытой
архитектуре, позволяющей осуществлять доступ и модификацию на любом уровне.

Данный документ является руководством пользователя по применению отладчика
по основному назначению.

Ошибки можно сообщать либо непосредственно автору: =<_deepfire@feelingofgreen.ru>=,
либо через анонимный багтрекер: http://www.feelingofgreen.ru:3000/projects/common-db/issues/new

*** Принятые обозначения

В документе применяются следующие обозначения:

    - шестнадцатеричные значения начинаются с префикса '#x', если префикс '#x'
      отсутствует, то значение считается десятичным;

* Обзор

Отладчик может работать в следующих режимах:

   - режим чтения команд из файла (режим пакетного исполнения);
   - интерактивный режим;

Синтаксисы режимов имеют [[Различие%20между%20синтаксисами%20интерактивного%20и%20пакетного%20режимов][поверхностное различие]].

В обоих режимах пользователь имеет полный доступ как к основной
функциональности отладчика, так и к средствам расширения предоставляемым
средой языка Common Lisp на котором построен отладчик.

Таким образом, с точки зрения пользователя привыкшего к отладчику
MDB, помимо привычной функциональности, а также добавочных возможностей
специфичных для comdb, появляется принципиально новая возможность
программировать отладчик в самом отладчике, как в интерактивном,
так и в пакетном режиме.

*** Новые возможности, специфичные для comdb

   - Сохранение/восстановление частичного слепка состояния, включающего
     регистры общего назначения, Cop0, TLB.  Слепки можно записывать и
     читать с диска.
   - Встроенный ассемблер/дизассемблер MIPS ISA.
   - Запись во флэш-память
     - SST38VF6401B (набор команд AMD/Spansion)
     - MT28F640J3 (набор команд Intel)
   - Расширенные возможности трассировки и пошагового исполнения,
     обусловленные программируемостью отладчик.
   - Богатая и достаточно точная информация о устройствах и регистрах
     спектра кристаллов платформы Мультикор (этой информацией,
     в частности, пользуется среда программирования MCStudio).
   - Богатая информация о структуре регистров -- регистровых полях.
   - Хороший набор тестов для плат основанных на Мультикор.

*** Дополнительные возможности программирования отладчика

Коротко можно перечислить подмножество дополнительных возможностей:

   - условные выражения;
   - циклы;
   - динамическая типизация значений переменных;
   - использование списков, хэш-таблиц, массивов и других структур данных;
   - доступ к богатой библиотеке функций манипулирующей обобщёнными
     последовательностями;
   - определение функций;
   - определение макросов оперирующих исходным кодом на уровне
     абстрактного синтаксического дерева и обладающих доступом
     ко всему языку во время расширения;
   - определение классов (с множественным наследованием);
   - богатая, основанная на классах, система исключительных ситуаций,
     дополненная механизмом как программируемого, так и интерактивного
     выбора варианта продолжения исполнения (т.н. restarts);
   - определение обобщённых функций с множественной диспетчеризацией;
   - функции ввода/вывода;
   - полноценный, интегрированный отладчик времения исполнения;
   - вызов внешних исполняемых файлов;
   - вызов внешних библиотек на языке C (не С++);

Вся эта функциональность дополняется компилятором генерирующим
высокоэффективный native-код процессора.

При этом, ничто из этой функциональности не является обязательным для
использования - пользователь желающий пользоваться /только/ командами
из привычной среды MDB будет чувствовать себя вполне как дома.

* Установка отладчика

Предоставляются отдельные версии отладчика для операционных систем Linux и
Windows (начиная с Windows 2000).

При работе как в OC Linux, так и в ОС Windows, отладчик требует
административный уровень доступа к системе.

