doc/comdb-notes-ru.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>COMMON-DB: отладчик для кристаллов семейства Мультикор</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-01-11 19:31:36 MSK"/>
<meta name="author" content="Serge Kosyrev"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">COMMON-DB: отладчик для кристаллов семейства Мультикор</h1>


<div style="text-align: center">
<p>Документация пользователя <br/>
<br/>
January 11, 2010, 19:29
</p>
</div>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Введение </a>
<ul>
<li><a href="#sec-1.1">1.1 Принятые обозначения </a></li>
</ul>
</li>
<li><a href="#sec-2">2 Обзор </a>
<ul>
<li><a href="#sec-2.1">2.1 Новые возможности, специфичные для comdb </a></li>
<li><a href="#sec-2.2">2.2 Дополнительные возможности программирования отладчика </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Установка отладчика </a>
<ul>
<li><a href="#sec-3.1">3.1 Замечания по настройке параллельного порта для работы с адаптером EPP </a></li>
<li><a href="#sec-3.2">3.2 Замечания по установке драйвера USB-адаптера в ОС Windows </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Режимы работы </a>
<ul>
<li><a href="#sec-4.1">4.1 Общие замечания по синтаксису </a>
<ul>
<li><a href="#sec-4.1.1">4.1.1 Чувствительность к регистру символов </a></li>
<li><a href="#sec-4.1.2">4.1.2 Основание используемое при печати/чтении чисел </a></li>
<li><a href="#sec-4.1.3">4.1.3 Различия в способах указания путей к файлам в Linux и Windows </a></li>
</ul>
</li>
<li><a href="#sec-4.2">4.2 Различие между синтаксисами интерактивного и пакетного режимов </a></li>
<li><a href="#sec-4.3">4.3 Интерактивный режим </a></li>
<li><a href="#sec-4.4">4.4 Режим пакетного исполнения </a></li>
<li><a href="#sec-4.5">4.5 Отладчик отладчика </a></li>
</ul>
</li>
<li><a href="#sec-5">5 Запуск отладчика </a>
<ul>
<li><a href="#sec-5.1">5.1 Параметры командной строки </a></li>
</ul>
</li>
<li><a href="#sec-6">6 Интерфейс </a>
<ul>
<li><a href="#sec-6.1">6.1 Терминология специфичная для тематики связанной с передачей аргументов функциям в языке Common Lisp </a></li>
<li><a href="#sec-6.2">6.2 Соглашение о передаче аргументов, лямбда-списки </a>
<ul>
<li><a href="#sec-6.2.1">6.2.1 Спецификаторы обязательных параметров </a></li>
<li><a href="#sec-6.2.2">6.2.2 Спецификаторы опциональных параметров </a></li>
<li><a href="#sec-6.2.3">6.2.3 Спецификатор остаточного параметра </a></li>
<li><a href="#sec-6.2.4">6.2.4 Спецификатор ключевых параметров </a></li>
<li><a href="#sec-6.2.5">6.2.5 Примеры обычных лямбда-списков </a></li>
</ul>
</li>
<li><a href="#sec-6.3">6.3 Управляющие переменные </a></li>
<li><a href="#sec-6.4">6.4 Документация </a></li>
<li><a href="#sec-6.5">6.5 Устройства </a></li>
<li><a href="#sec-6.6">6.6 Ввод/вывод </a></li>
<li><a href="#sec-6.7">6.7 Управление состоянием </a></li>
<li><a href="#sec-6.8">6.8 Ловушки </a></li>
<li><a href="#sec-6.9">6.9 DSP </a></li>
<li><a href="#sec-6.10">6.10 Адреса и символы </a></li>
<li><a href="#sec-6.11">6.11 Анализ </a></li>
<li><a href="#sec-6.12">6.12 Вмешательство </a></li>
<li><a href="#sec-6.13">6.13 Трассировка </a></li>
<li><a href="#sec-6.14">6.14 Прочее </a></li>
<li><a href="#sec-6.15">6.15 Грубое управление </a></li>
<li><a href="#sec-6.16">6.16 Тестирование </a></li>
<li><a href="#sec-6.17">6.17 Команды отладчика MDB получившие новое название </a></li>
</ul>
</li>
<li><a href="#sec-7">7 Описание ключевых операций </a>
<ul>
<li><a href="#sec-7.1">7.1 Инициализация </a>
<ul>
<li><a href="#sec-7.1.1">7.1.1 Первичная инициализация </a>
<ul>
<li><a href="#sec-7.1.1.1">7.1.1.1 Поиск адаптеров </a></li>
<li><a href="#sec-7.1.1.2">7.1.1.2 Анализ OnCD подключенного целевого устройства </a></li>
<li><a href="#sec-7.1.1.3">7.1.1.3 Определение типа платформы целевого устройства </a></li>
<li><a href="#sec-7.1.1.4">7.1.1.4 Инициализацию компонентов платформы целевого устройства </a></li>
</ul>
</li>
<li><a href="#sec-7.1.2">7.1.2 Повторная инициализация </a>
<ul>
<li><a href="#sec-7.1.2.1">7.1.2.1 Определение текущего значения делителя частоты кристалла. </a></li>
<li><a href="#sec-7.1.2.2">7.1.2.2 Сброс кристалла в первоначальное состояние </a></li>
<li><a href="#sec-7.1.2.3">7.1.2.3 Установка глубины режима отладки </a></li>
</ul></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-8">8 Существенные недостатки </a></li>
<li><a href="#sec-9">9 Словарь </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Введение </h2>
<div class="outline-text-2" id="text-1">


<p>
Отладчик COMMON-DB (сокращённо "comdb") – программируемая среда
обеспечивающая доступ к базовым аппаратным средствам отладки (OnCD)
процессоров семейства Elvees Multicore.  Доступ к OnCD осуществляется
через внешний порт соответствующий стандарту JTAG (IEEE 1149.1).
В свою очередь, доступ к порту JTAG осуществляется с помощью двух
вариантов адаптера, сообщающихся с PC посредством EPP (параллельного
порта) или USB.
</p>
<p>
Отладчик предоставляет ограниченную совместимость с основным множеством
команд отладчика MDB.
</p>
<p>
Программируемость отладчика достигается ввиду его реализации на
ЯВУ (языке высокого уровня) ANSI Common Lisp (ANSI INCITS 226-1994),
позволяющему органичное расширение уже скомпилированных приложений,
а также включающему богатую, динамичную среду исполнения, и открытой
архитектуре, позволяющей осуществлять доступ и модификацию на любом уровне.
</p>
<p>
Данный документ является руководством пользователя по применению отладчика
по основному назначению.
</p>
<p>
Ошибки можно сообщать либо непосредственно автору: <code>&lt;_deepfire@feelingofgreen.ru&gt;</code>,
либо через анонимный багтрекер: <a href="http://www.feelingofgreen.ru:3000/projects/common-db/issues/new">http://www.feelingofgreen.ru:3000/projects/common-db/issues/new</a>
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Принятые обозначения </h3>
<div class="outline-text-3" id="text-1.1">


<p>
В документе применяются следующие обозначения:
</p>
<ul>
<li>
шестнадцатеричные значения начинаются с префикса '#x', если префикс '#x'
отсутствует, то значение считается десятичным;

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Обзор </h2>
<div class="outline-text-2" id="text-2">


<p>
Отладчик может работать в следующих режимах:
</p>
<ul>
<li>
режим чтения команд из файла (режим пакетного исполнения);
</li>
<li>
интерактивный режим;

</li>
</ul>

<p>Синтаксисы режимов имеют <a href="#sec-4.2">поверхностное различие</a>.
</p>
<p>
В обоих режимах пользователь имеет полный доступ как к основной
функциональности отладчика, так и к средствам расширения предоставляемым
средой языка Common Lisp на котором построен отладчик.
</p>
<p>
Таким образом, с точки зрения пользователя привыкшего к отладчику
MDB, помимо привычной функциональности, а также добавочных возможностей
специфичных для comdb, появляется принципиально новая возможность
программировать отладчик в самом отладчике, как в интерактивном,
так и в пакетном режиме.
</p>

</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> Новые возможности, специфичные для comdb </h3>
<div class="outline-text-3" id="text-2.1">


<ul>
<li>
Сохранение/восстановление частичного слепка состояния, включающего
регистры общего назначения, Cop0, TLB.  Слепки можно записывать и
читать с диска.
</li>
<li>
Встроенный ассемблер/дизассемблер MIPS ISA.
</li>
<li>
Запись во флэш-память
<ul>
<li>
SST38VF6401B (набор команд AMD/Spansion)
</li>
<li>
MT28F640J3 (набор команд Intel)
</li>
</ul>
</li>
<li>
Расширенные возможности трассировки и пошагового исполнения,
обусловленные программируемостью отладчик.
</li>
<li>
Богатая и достаточно точная информация о устройствах и регистрах
спектра кристаллов платформы Мультикор (этой информацией,
в частности, пользуется среда программирования MCStudio).
</li>
<li>
Богатая информация о структуре регистров &ndash; регистровых полях.
</li>
<li>
Хороший набор тестов для плат основанных на Мультикор.

</li>
</ul>
</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> Дополнительные возможности программирования отладчика </h3>
<div class="outline-text-3" id="text-2.2">


<p>
Коротко можно перечислить подмножество дополнительных возможностей:
</p>
<ul>
<li>
условные выражения;
</li>
<li>
циклы;
</li>
<li>
динамическая типизация значений переменных;
</li>
<li>
использование списков, хэш-таблиц, массивов и других структур данных;
</li>
<li>
доступ к богатой библиотеке функций манипулирующей обобщёнными
последовательностями;
</li>
<li>
определение функций;
</li>
<li>
определение макросов оперирующих исходным кодом на уровне
абстрактного синтаксического дерева и обладающих доступом
ко всему языку во время расширения;
</li>
<li>
определение классов (с множественным наследованием);
</li>
<li>
богатая, основанная на классах, система исключительных ситуаций,
дополненная механизмом как программируемого, так и интерактивного
выбора варианта продолжения исполнения (т.н. restarts);
</li>
<li>
определение обобщённых функций с множественной диспетчеризацией;
</li>
<li>
функции ввода/вывода;
</li>
<li>
полноценный, интегрированный отладчик времения исполнения;
</li>
<li>
вызов внешних исполняемых файлов;
</li>
<li>
вызов внешних библиотек на языке C (не С++);

</li>
</ul>

<p>Вся эта функциональность дополняется компилятором генерирующим
высокоэффективный native-код процессора.
</p>
<p>
При этом, ничто из этой функциональности не является обязательным для
использования - пользователь желающий пользоваться <i>только</i> командами
из привычной среды MDB будет чувствовать себя вполне как дома.
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Установка отладчика </h2>
<div class="outline-text-2" id="text-3">


<p>
Предоставляются отдельные версии отладчика для операционных систем Linux и
Windows (начиная с Windows 2000).
</p>
<p>
При работе как в OC Linux, так и в ОС Windows, отладчик требует
административный уровень доступа к системе.
</p>

</div>
