doc/comdb-notes-ru.org
*** Замечания по настройке параллельного порта для работы с адаптером EPP

Параллельный порт компьютера должен быть сконфигурирован в BIOS следующим
образом:

   - BASE ADDRESS: 0x378;
   - MODE: EPP or EPP/ECP;
   - EPP version: 1.9.

Для осуществления доступа к параллельному порту в ОС Windows, отладчик
автоматически устанавливает драйвер mcdbio.sys.  Перед запуском,
необходимо убедиться в том что драйвер находится в той же папке что и
исполняемый файл отладчика.

*** Замечания по установке драйвера USB-адаптера в ОС Windows

Для использования отладчика с USB-адаптером в ОС Windows, соответствующий
драйвер (ezusb.sys) необходимо устанавливать вручную, путём подключения
адаптера и представления системе Windows необходимой информации о расположении
inf-файла драйвера через всплывающее окно, автоматически появляющееся при
подключении адаптера.  Появляющееся сообщение об отсутствии сертификации
драйвера следует проигнорировать.

* Режимы работы

Как уже было отмечено выше, comdb предлагает два режима работы,
интерактивный и режим пакетного исполнения (могущий, при возникновении
исключительных ситуаций, перейти в интерактивный).

*** Общие замечания по синтаксису
***** Чувствительность к регистру символов

В общем, за исключением строчных значений, отладчик нечувствителен
к разряду символов[fn:1].  Эстетика языка Common Lisp, однако,
предполагает использование нижнего разряда во всех случаях где разряд
не имеет значения.

***** Основание используемое при печати/чтении чисел

По умолчанию =*PRINT-BASE*=, переменная задающая основание используемое для печати чисел,
имеет значение равное 16; установитьеё значение в 10 можно следующим образом:

      : setf *print-base* #xa

По умолчанию =*READ-BASE*=, переменная задающая основание используемое для чтения вводимых чисел,
имеет значение равное 10; установить её значение в 16 можно следующим образом:

      : setf *read-base* #x10

или,

      : expert

***** Различия в способах указания путей к файлам в Linux и Windows

В среде Linux пути указываются каноническим для UNIX-систем образом:

: "/path/to/foo"

однако в Windows, обычные для разделителей компонентов пути в этой системе
обратные слэши заменены на прямые:

: "d:/path/to/foo"

*** Различие между синтаксисами интерактивного и пакетного режимов
     
Синтаксисы интерактивного и пакетного режимов имеют различие обусловленное
стремлением упростить работу в интерактивном режиме.  Корень различия
заключается в необходимости заключения всех вызовов функций и макросов
в круглые скобки, связанной с требованиями языка Лисп.

Очевидно что в интерактивном режиме это требование крайне неудобно,
т.к. требует ручного ввода двух, строго говоря необязательных, символов
в каждой команде.  Более того, абсолютная необходимость в скобках привела
бы к невозможности реализации режима ограниченной совместимости с набором
команд отладчика MDB.

В связи с этим, в интерактивном режиме реализована возможность опускать
внешний уровень скобок.

Пакетный режим в данный момент не предоставляет такой возможности[fn:2].

*** Интерактивный режим
*** Режим пакетного исполнения
    Отладчик позволяет выполнять команды из файлов, при этом файлы команд могут
содержать комментарии, пустые строки и команды исполнения других файлов.

Комментарии бывают двух видов:

    - строчно ориентированные: начинаются с символа ';' и продолжаются до конца строки;
    - блочно-ориентированные: начинаются с подстроки "#|" и заканчиваются подстрокой "|#".

В связи с тем что, как уже было отмечено выше, пакетный режим накладывает необходимость
окружения каждой отдельной команды скобками, в одной строке файла могут находиться несколько команд.

*** Отладчик отладчика

При возникновении исключительных ситуаций (в т.ч. ошибок) в обоих
режимах исполнения активируется отладчик среды Common Lisp, в котором
также можно исполнять команды comdb, а также активировать т.н. /рестарты/ -
реакции заготовленные на случаи возникновения исключительных ситуаций
в данном контексте.

Активация рестарта позволяет продолжить исполнение тем или иным образом.
Выбор рестартов осуществляется вводом либо соответствующего ему номера,
либо сокращения от его имени, префиксированного ':'

#+BEGIN_VERSE
        /0-9/ - выбрать соответствующий рестарт
        /:a/  - выбрать самый верхний рестарт с именем начинающимся на A
#+END_VERSE
* Запуск отладчика
*** Параметры командной строки

#+BEGIN: comdb-help :path "~/source/common-db/"
/bin/bash: ./comdb-ru: No such file or directory

#+END

   - параметр =--core-multiplier= интерпретируется как десятичное целое, в других случаях
     всё что похоже на целое число, воспринимается как шестнадцатиричное[fn:3];
   - параметр =--load= интерпретируется как строка;
   - иначе объект воспринимается как Лисп-выражение

* Интерфейс
  Ниже следуют описание глобальных переменных и команд, представляющих
собой часть пользовательского интерфейса.  Команды реализованы в виде обычных
функций языка Common Lisp, и, как следствие, соглашение передачи аргументов
соответствует соглашению принятому в Common Lisp.  Первый раздел данной главы
описывает этот механизм.

*** Терминология специфичная для тематики связанной с передачей аргументов функциям в языке Common Lisp
  - <<<лямбда-список>>> ::
    Список задающий набор параметров и протокол получения значений для этих параметров.
  - <<<аргумент>>> ::
    Объект представляемый в качестве входных данных функции, в момент её вызова.
  - <<<параметр>>> ::
    Переменная в определении функции, принимающая значение соответствующего аргумента (или списка соответствующих аргументов)
    данной функции в момент её вызова, или, в некоторых случаях, получающая значение по умолчанию, потому что соответствующего
    аргумента нет.
  - <<<спецификатор параметра>>> ::
    Выражение, являющееся частью лямбда-списка, представляющее собой символ или список, используемое для задания параметра,
    и интерпретируемое в контексте
    - ключевых слов лямбда-списка, и
    - параметров заданных указанными ранее спецификаторами параметров.

