doc/comdb-notes-ru.html

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1"><span class="section-number-3">3.1</span> Замечания по настройке параллельного порта для работы с адаптером EPP </h3>
<div class="outline-text-3" id="text-3.1">


<p>
Параллельный порт компьютера должен быть сконфигурирован в BIOS следующим
образом:
</p>
<ul>
<li>
BASE ADDRESS: 0x378;
</li>
<li>
MODE: EPP or EPP/ECP;
</li>
<li>
EPP version: 1.9.

</li>
</ul>

<p>Для осуществления доступа к параллельному порту в ОС Windows, отладчик
автоматически устанавливает драйвер mcdbio.sys.  Перед запуском,
необходимо убедиться в том что драйвер находится в той же папке что и
исполняемый файл отладчика.
</p>
</div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2"><span class="section-number-3">3.2</span> Замечания по установке драйвера USB-адаптера в ОС Windows </h3>
<div class="outline-text-3" id="text-3.2">


<p>
Для использования отладчика с USB-адаптером в ОС Windows, соответствующий
драйвер (ezusb.sys) необходимо устанавливать вручную, путём подключения
адаптера и представления системе Windows необходимой информации о расположении
inf-файла драйвера через всплывающее окно, автоматически появляющееся при
подключении адаптера.  Появляющееся сообщение об отсутствии сертификации
драйвера следует проигнорировать.
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Режимы работы </h2>
<div class="outline-text-2" id="text-4">


<p>
Как уже было отмечено выше, comdb предлагает два режима работы,
интерактивный и режим пакетного исполнения (могущий, при возникновении
исключительных ситуаций, перейти в интерактивный).
</p>

</div>

<div id="outline-container-4.1" class="outline-3">
<h3 id="sec-4.1"><span class="section-number-3">4.1</span> Общие замечания по синтаксису </h3>
<div class="outline-text-3" id="text-4.1">


</div>

<div id="outline-container-4.1.1" class="outline-4">
<h4 id="sec-4.1.1"><span class="section-number-4">4.1.1</span> Чувствительность к регистру символов </h4>
<div class="outline-text-4" id="text-4.1.1">


<p>
В общем, за исключением строчных значений, отладчик нечувствителен
к разряду символов<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup>.  Эстетика языка Common Lisp, однако,
предполагает использование нижнего разряда во всех случаях где разряд
не имеет значения.
</p>
</div>

</div>

<div id="outline-container-4.1.2" class="outline-4">
<h4 id="sec-4.1.2"><span class="section-number-4">4.1.2</span> Основание используемое при печати/чтении чисел </h4>
<div class="outline-text-4" id="text-4.1.2">


<p>
По умолчанию <code>*PRINT-BASE*</code>, переменная задающая основание используемое для печати чисел,
имеет значение равное 16; установитьеё значение в 10 можно следующим образом:
</p>
<pre class="example">
setf *print-base* #xa
</pre>


<p>
По умолчанию <code>*READ-BASE*</code>, переменная задающая основание используемое для чтения вводимых чисел,
имеет значение равное 10; установить её значение в 16 можно следующим образом:
</p>
<pre class="example">
setf *read-base* #x10
</pre>


<p>
или,
</p>
<pre class="example">
expert
</pre>


</div>

</div>

<div id="outline-container-4.1.3" class="outline-4">
<h4 id="sec-4.1.3"><span class="section-number-4">4.1.3</span> Различия в способах указания путей к файлам в Linux и Windows </h4>
<div class="outline-text-4" id="text-4.1.3">


<p>
В среде Linux пути указываются каноническим для UNIX-систем образом:
</p>
<pre class="example">
"/path/to/foo"
</pre>


<p>
однако в Windows, обычные для разделителей компонентов пути в этой системе
обратные слэши заменены на прямые:
</p>
<pre class="example">
"d:/path/to/foo"
</pre>


</div>
</div>

</div>

<div id="outline-container-4.2" class="outline-3">
<h3 id="sec-4.2"><span class="section-number-3">4.2</span> Различие между синтаксисами интерактивного и пакетного режимов </h3>
<div class="outline-text-3" id="text-4.2">


<p>
Синтаксисы интерактивного и пакетного режимов имеют различие обусловленное
стремлением упростить работу в интерактивном режиме.  Корень различия
заключается в необходимости заключения всех вызовов функций и макросов
в круглые скобки, связанной с требованиями языка Лисп.
</p>
<p>
Очевидно что в интерактивном режиме это требование крайне неудобно,
т.к. требует ручного ввода двух, строго говоря необязательных, символов
в каждой команде.  Более того, абсолютная необходимость в скобках привела
бы к невозможности реализации режима ограниченной совместимости с набором
команд отладчика MDB.
</p>
<p>
В связи с этим, в интерактивном режиме реализована возможность опускать
внешний уровень скобок.
</p>
<p>
Пакетный режим в данный момент не предоставляет такой возможности<sup><a class="footref" name="fnr.2" href="#fn.2">2</a></sup>.
</p>
</div>

</div>

<div id="outline-container-4.3" class="outline-3">
<h3 id="sec-4.3"><span class="section-number-3">4.3</span> Интерактивный режим </h3>
<div class="outline-text-3" id="text-4.3">

</div>

</div>

<div id="outline-container-4.4" class="outline-3">
<h3 id="sec-4.4"><span class="section-number-3">4.4</span> Режим пакетного исполнения </h3>
<div class="outline-text-3" id="text-4.4">

<p>Отладчик позволяет выполнять команды из файлов, при этом файлы команд могут
содержать комментарии, пустые строки и команды исполнения других файлов.
</p>
<p>
Комментарии бывают двух видов:
</p>
<ul>
<li>
строчно ориентированные: начинаются с символа ';' и продолжаются до конца строки;
</li>
<li>
блочно-ориентированные: начинаются с подстроки "#|" и заканчиваются подстрокой "|#".

</li>
</ul>

<p>В связи с тем что, как уже было отмечено выше, пакетный режим накладывает необходимость
окружения каждой отдельной команды скобками, в одной строке файла могут находиться несколько команд.
</p>
</div>

</div>

<div id="outline-container-4.5" class="outline-3">
<h3 id="sec-4.5"><span class="section-number-3">4.5</span> Отладчик отладчика </h3>
<div class="outline-text-3" id="text-4.5">


<p>
При возникновении исключительных ситуаций (в т.ч. ошибок) в обоих
режимах исполнения активируется отладчик среды Common Lisp, в котором
также можно исполнять команды comdb, а также активировать т.н. <i>рестарты</i> -
реакции заготовленные на случаи возникновения исключительных ситуаций
в данном контексте.
</p>
<p>
Активация рестарта позволяет продолжить исполнение тем или иным образом.
Выбор рестартов осуществляется вводом либо соответствующего ему номера,
либо сокращения от его имени, префиксированного ':'
</p>

<p class="verse">
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <i>0-9</i> - выбрать соответствующий рестарт<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <i>:a</i>  - выбрать самый верхний рестарт с именем начинающимся на A<br/>
</p>

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Запуск отладчика </h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5.1" class="outline-3">
<h3 id="sec-5.1"><span class="section-number-3">5.1</span> Параметры командной строки </h3>
<div class="outline-text-3" id="text-5.1">


<p>
/bin/bash: ./comdb-ru: No such file or directory
</p>

<ul>
<li>
<a href="#параметр">параметр</a> <code>--core-multiplier</code> интерпретируется как десятичное целое, в других случаях
всё что похоже на целое число, воспринимается как шестнадцатиричное<sup><a class="footref" name="fnr.3" href="#fn.3">3</a></sup>;
</li>
<li>
<a href="#параметр">параметр</a> <code>--load</code> интерпретируется как строка;
</li>
<li>
иначе объект воспринимается как Лисп-выражение

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Интерфейс </h2>
<div class="outline-text-2" id="text-6">

<p>Ниже следуют описание глобальных переменных и команд, представляющих
собой часть пользовательского интерфейса.  Команды реализованы в виде обычных
функций языка Common Lisp, и, как следствие, соглашение передачи аргументов
соответствует соглашению принятому в Common Lisp.  Первый раздел данной главы
описывает этот механизм.
</p>

</div>

<div id="outline-container-6.1" class="outline-3">
<h3 id="sec-6.1"><span class="section-number-3">6.1</span> Терминология специфичная для тематики связанной с передачей аргументов функциям в языке Common Lisp </h3>
<div class="outline-text-3" id="text-6.1">

<dl>
<dt><a name="лямбда-список" class="target">лямбда-список</a></dt><dd>

<p>
Список задающий набор параметров и протокол получения значений для этих параметров.
</p></dd>
<dt><a name="аргумент" class="target">аргумент</a></dt><dd>

<p>
Объект представляемый в качестве входных данных функции, в момент её вызова.
</p></dd>
<dt><a name="параметр" class="target">параметр</a></dt><dd>

<p>
Переменная в определении функции, принимающая значение соответствующего аргумента (или списка соответствующих аргументов)
данной функции в момент её вызова, или, в некоторых случаях, получающая значение по умолчанию, потому что соответствующего
аргумента нет.
</p></dd>
<dt><a name="спецификатор==параметра" class="target">спецификатор параметра</a></dt><dd>

<p>
Выражение, являющееся частью лямбда-списка, представляющее собой <a href="#символ">символ</a> или список, используемое для задания параметра,
и интерпретируемое в контексте
</p><ul>
<li>
ключевых слов лямбда-списка, и
</li>
<li>
параметров заданных указанными ранее спецификаторами параметров.

</li>
</ul>
</dd>
</dl>
</div>

</div>
