doc/comdb-notes-ru.org
*** Соглашение о передаче аргументов, лямбда-списки
Лямбда-список это список задающий набор параметров (иногда называемых лямбда-переменными),
и протокол принятия этих параметров.  В данном контексте используется только один тип
лямбда-списков -- т.н. обычный лямбда-список.

Обычный лямбда-список может содержать следующие ключевые слова лямбда-списка[fn:4]:

  - &allow-other-keys
  - &key
  - &optional
  - &rest

Каждый элемент лямбда-списка является либо спецификатором параметра, либо ключевым словом
лямбда-списка.  Упрощённый синтаксис обычного лямбда-списка таков[fn:5]:

 : lambda-list::= (var*
 :                 [&optional {var | (var [init-form])}*]
 :                 [&rest var]
 :                 [&key {var | (var [init-form])}* [&allow-other-keys]])

Инициализационные формы INIT-FORM могут представлять собой любые формы.
Обычный лямбда-список имеет четыре интересующих нас части, любая, или каждая из которых может быть пустой.

***** Спецификаторы обязательных параметров
Это все спецификаторы параметров до первого ключевого слова лямбда-списка; если ключевые слова лямбда-списка отсутствуют,
тогда все спецификаторы задают обязательные параметры.

Если присутствуют N обязательных параметров (N может быть равно нулю), то должно быть передано как минимум N аргументов,
и переменные обязательных параметров привязываются к первым N из переданных аргументов.  Остальные параметры, затем,
обрабатываются с использованием каких-либо оставшихся аргументов.

***** Спецификаторы опциональных параметров
Если присутствует &optional, то спецификаторами опциональных параметров являются те что следуют за &optional, и до следующего
ключевого слова лямбда-списка, либо конца списка.  Если опциональные параметры заданы, тогда каждый из них обрабатывается следующим
образом.  Если остаются необработанные аргументы, тогда переменная параметра привязывается к следующему аргументу, также как
и в случае с обязательными параметрами.  Если, однако, аргументов более не осталось, тогда вычисляется INIT-FORM и переменная
параметра привязывается к полученному значению (или nil, если INIT-FORM не указана в спецификаторе параметра).

***** Спецификатор остаточного параметра
&rest, когда оно присутствует, должно быть сопровождено следующим за ним едиственным спецификатором остаточного параметра, за которым,
в свою очередь, должно следовать либо другое ключевое слово лямбда-списка, либо окончание лямбда-списка.  После того как были
обработаны спецификаторы всех опциональных параметров, может присутствовать, а может и не присутствовать остаточный параметр.
Если остаточный параметр присутствует, он привязывается к списку всех необработанных к данному моменту аргументов.
Если необработанных аргументов не осталось, остаточный параметр привязывается к пустому списку.  Если остаточный параметр отстутствует,
и нет ключевых параметров, тогда, при наличии необработанных аргументов, должна сигнализироваться ошибка.

***** Спецификатор ключевых параметров
Если &key присутствует, все спецификаторы до следующего ключевого слова лямбда-списка, либо до конца лямбда-списка являются
спецификаторами ключевых параметров.  При обработке ключевых параметров, обрабатываются те же аргументы что попали бы в список
остаточного параметра.  Разрешено указывать вместе &rest и &key.  В этом случае, остающиеся аргументы используются для обоих целей;
то есть, все остающиеся аргументы собираются в список для остаточного параметра, и, одновременно обрабатываются в качестве
параметров &key.  Если &key указан, то должно оставаться чётное количество аргументов.  Эти аргументы рассматриваются как пары,
причём первый элемент в каждой паре интерпретируется в качестве имени, а второй в качестве соответствующего значения.  Первый объект
в каждой паре должен быть символом.  Спецификаторы ключевых параметров могут опционально сопровождаться ключевым словом лямбда-списка
&allow-other-keys.

Каждый спецификатор ключевого параметра должен содержать имя переменной параметра.  Имя ключевого слова используемое для совмещения
аргументов и параметров является символом в пакете KEYWORD (чья печатная форма, стало быть, префиксируется двоеточием), чьё имя равно
имени переменной параметра.

Спецификаторы ключевых параметров, как и все спецификаторы параметров, фактически обрабатываются слева-направо.  Для каждого
спецификатора ключевого параметра, при наличии пары аргументов чей именной компонент совпадает с именем спецификатора,
производится привязывание переменной параметра ко второму элементу (значению) этой пары аргументов.  Если более чем одна
пара аргументов подходит, то используется самая левая из них.  Если ни одна пара аргументов не подходит, то вычисляется INIT-FORM
данного спецификатора параметра, и переменная параметра привязывается к полученному значению (или к nil, если INIT-FORM не указана).
Если проверка ключевых аргументов не отключена, то пары аргументов должны содержать имена соответствующие именам спецификаторов
параметров.

Если проверка ключевых аргументов отключена, тогда парам аргументов разрешается не совпадать ни с каким из спецификаторов
параметров, и тогда такие пары игнорируются, оставаясь, однако, доступными через остаточный параметр, если таковой был указан.

