doc/comdb-notes-ru.html

<div id="outline-container-6.2" class="outline-3">
<h3 id="sec-6.2"><span class="section-number-3">6.2</span> Соглашение о передаче аргументов, лямбда-списки </h3>
<div class="outline-text-3" id="text-6.2">

<p><a href="#Лямбда-список">Лямбда-список</a> это список задающий набор параметров (иногда называемых лямбда-переменными),
и протокол принятия этих параметров.  В данном контексте используется только один тип
лямбда-списков &ndash; т.н. <a href="#sec-6.2">обычный лямбда-список</a>.
</p>
<p>
<a href="#sec-6.2">Обычный лямбда-список</a> может содержать следующие <a href="#ключевые==слова==лямбда-списка">ключевые слова лямбда-списка</a><sup><a class="footref" name="fnr.4" href="#fn.4">4</a></sup>:
</p>
<ul>
<li>
&amp;allow-other-keys
</li>
<li>
&amp;key
</li>
<li>
&amp;optional
</li>
<li>
&amp;rest

</li>
</ul>

<p>Каждый элемент лямбда-списка является либо спецификатором параметра, либо ключевым словом
лямбда-списка.  Упрощённый синтаксис обычного лямбда-списка таков<sup><a class="footref" name="fnr.5" href="#fn.5">5</a></sup>:
</p>
<pre class="example">
lambda-list::= (var*
                [&amp;optional {var | (var [init-form])}*]
                [&amp;rest var]
                [&amp;key {var | (var [init-form])}* [&amp;allow-other-keys]])
</pre>


<p>
Инициализационные формы INIT-FORM могут представлять собой любые формы.
<a href="#sec-6.2">Обычный лямбда-список</a> имеет четыре интересующих нас части, любая, или каждая из которых может быть пустой.
</p>

</div>

<div id="outline-container-6.2.1" class="outline-4">
<h4 id="sec-6.2.1"><span class="section-number-4">6.2.1</span> Спецификаторы обязательных параметров </h4>
<div class="outline-text-4" id="text-6.2.1">

<p>Это все спецификаторы параметров до первого ключевого слова лямбда-списка; если <a href="#ключевые==слова==лямбда-списка">ключевые слова лямбда-списка</a> отсутствуют,
тогда все спецификаторы задают обязательные параметры.
</p>
<p>
Если присутствуют N обязательных параметров (N может быть равно нулю), то должно быть передано как минимум N аргументов,
и переменные обязательных параметров привязываются к первым N из переданных аргументов.  Остальные параметры, затем,
обрабатываются с использованием каких-либо оставшихся аргументов.
</p>
</div>

</div>

<div id="outline-container-6.2.2" class="outline-4">
<h4 id="sec-6.2.2"><span class="section-number-4">6.2.2</span> Спецификаторы опциональных параметров </h4>
<div class="outline-text-4" id="text-6.2.2">

<p>Если присутствует &amp;optional, то спецификаторами опциональных параметров являются те что следуют за &amp;optional, и до следующего
ключевого слова лямбда-списка, либо конца списка.  Если опциональные параметры заданы, тогда каждый из них обрабатывается следующим
образом.  Если остаются необработанные аргументы, тогда переменная параметра привязывается к следующему аргументу, также как
и в случае с обязательными параметрами.  Если, однако, аргументов более не осталось, тогда вычисляется INIT-FORM и переменная
параметра привязывается к полученному значению (или nil, если INIT-FORM не указана в спецификаторе параметра).
</p>
</div>

</div>

<div id="outline-container-6.2.3" class="outline-4">
<h4 id="sec-6.2.3"><span class="section-number-4">6.2.3</span> Спецификатор остаточного параметра </h4>
<div class="outline-text-4" id="text-6.2.3">

<p>&amp;rest, когда оно присутствует, должно быть сопровождено следующим за ним едиственным спецификатором остаточного параметра, за которым,
в свою очередь, должно следовать либо другое <a href="#ключевое==слово">ключевое слово</a> лямбда-списка, либо окончание лямбда-списка.  После того как были
обработаны спецификаторы всех опциональных параметров, может присутствовать, а может и не присутствовать <a href="#sec-6.2.3">остаточный параметр</a>.
Если <a href="#sec-6.2.3">остаточный параметр</a> присутствует, он привязывается к списку всех необработанных к данному моменту аргументов.
Если необработанных аргументов не осталось, <a href="#sec-6.2.3">остаточный параметр</a> привязывается к пустому списку.  Если <a href="#sec-6.2.3">остаточный параметр</a> отстутствует,
и нет ключевых параметров, тогда, при наличии необработанных аргументов, должна сигнализироваться ошибка.
</p>
</div>

</div>

<div id="outline-container-6.2.4" class="outline-4">
<h4 id="sec-6.2.4"><span class="section-number-4">6.2.4</span> Спецификатор ключевых параметров </h4>
<div class="outline-text-4" id="text-6.2.4">

<p>Если &amp;key присутствует, все спецификаторы до следующего ключевого слова лямбда-списка, либо до конца лямбда-списка являются
спецификаторами ключевых параметров.  При обработке ключевых параметров, обрабатываются те же аргументы что попали бы в список
остаточного параметра.  Разрешено указывать вместе &amp;rest и &amp;key.  В этом случае, остающиеся аргументы используются для обоих целей;
то есть, все остающиеся аргументы собираются в список для остаточного параметра, и, одновременно обрабатываются в качестве
параметров &amp;key.  Если &amp;key указан, то должно оставаться чётное количество аргументов.  Эти аргументы рассматриваются как пары,
причём первый элемент в каждой паре интерпретируется в качестве имени, а второй в качестве соответствующего значения.  Первый объект
в каждой паре должен быть символом.  Спецификаторы ключевых параметров могут опционально сопровождаться ключевым словом лямбда-списка
&amp;allow-other-keys.
</p>
<p>
Каждый спецификатор ключевого параметра должен содержать имя переменной параметра.  Имя ключевого слова используемое для совмещения
аргументов и параметров является символом в пакете KEYWORD (чья печатная форма, стало быть, префиксируется двоеточием), чьё имя равно
имени переменной параметра.
</p>
<p>
Спецификаторы ключевых параметров, как и все спецификаторы параметров, фактически обрабатываются слева-направо.  Для каждого
спецификатора ключевого параметра, при наличии пары аргументов чей именной компонент совпадает с именем спецификатора,
производится привязывание переменной параметра ко второму элементу (значению) этой пары аргументов.  Если более чем одна
пара аргументов подходит, то используется самая левая из них.  Если ни одна пара аргументов не подходит, то вычисляется INIT-FORM
данного спецификатора параметра, и переменная параметра привязывается к полученному значению (или к nil, если INIT-FORM не указана).
Если проверка ключевых аргументов не отключена, то пары аргументов должны содержать имена соответствующие именам спецификаторов
параметров.
</p>
<p>
Если проверка ключевых аргументов отключена, тогда парам аргументов разрешается не совпадать ни с каким из спецификаторов
параметров, и тогда такие пары игнорируются, оставаясь, однако, доступными через <a href="#sec-6.2.3">остаточный параметр</a>, если таковой был указан.
</p>
</div>

</div>
