doc/comdb-notes-ru.org
***** Примеры обычных лямбда-списков
Вот несколько примеров использующих опциональные и остаточные параметра:

#+BEGIN_SRC emacs-lisp
  ((lambda (a b)
     (+ a (* b 3)))
   4 5)
 =>  19
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ((lambda (a &optional (b 2))
     (+ a (* b 3)))
   4 5)
 =>  19
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ((lambda (a &optional (b 2))
     (+ a (* b 3)))
   4)
 =>  10
#+END_SRC

Вот несколько примеров использующих ключевые параметры:

#+BEGIN_SRC emacs-lisp
  ((lambda (a b &key c d)
     (list a b c d))
   1 2)
 =>  (1 2 NIL NIL)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ((lambda (a b &key c d)
     (list a b c d))
   1 2 :c 6)
 =>  (1 2 6 NIL)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ((lambda (a b &key c d)
     (list a b c d))
   1 2 :d 8)
 =>  (1 2 NIL 8)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ((lambda (a b &key c d)
     (list a b c d))
   1 2 :c 6 :d 8)
 =>  (1 2 6 8)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ((lambda (a b &key c d)
     (list a b c d))
   1 2 :d 8 :c 6)
 =>  (1 2 6 8)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ((lambda (a b &key c d)
     (list a b c d))
   :a 1 :d 8 :c 6)
 =>  (:a 1 6 8)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ((lambda (a b &key c d)
     (list a b c d))
   :a :b :c :d)
 =>  (:a :b :d NIL)
#+END_SRC

Вот несколько примеров использующих опциональные, остаточные и ключевые параметры вместе:

#+BEGIN_SRC emacs-lisp
  ((lambda (a &optional (b 3) &rest x &key c (d a))
     (list a b c d x))
   1)
 =>  (1 3 NIL 1 ())
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ((lambda (a &optional (b 3) &rest x &key c (d a))
     (list a b c d x))
   1 2)
 =>  (1 2 NIL 1 ())
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ((lambda (a &optional (b 3) &rest x &key c (d a))
     (list a b c d x))
   :c 7)
 =>  (:c 7 NIL :c ())
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ((lambda (a &optional (b 3) &rest x &key c (d a))
     (list a b c d x))
   1 6 :c 7)
 =>  (1 6 7 1 (:c 7))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ((lambda (a &optional (b 3) &rest x &key c (d a))
     (list a b c d x))
   1 6 :d 8)
 =>  (1 6 NIL 8 (:d 8))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ((lambda (a &optional (b 3) &rest x &key c (d a))
     (list a b c d x))
   1 6 :d 8 :c 9 :d 10)
 =>  (1 6 9 8 (:d 8 :c 9 :d 10))
#+END_SRC


#+BEGIN: comdb-command-documentation :path "~/source/common-db/"
*** Управляющие переменные
     - =*disable-usb*= ::

     - =*display*= ::

     - =*examine-tlb*= ::

     - =*explain*= ::

     - =*force-memory-detection*= ::

     - =*forced-platform*= ::

     - =*inhibit-memory-detection*= ::

     - =*keep-target-intact*= ::

     - =*log-bus-events*= ::

     - =*log-core-pipeline-crit*= ::

     - =*log-graft-access*= ::

     - =*log-interface-bus-discovery*= ::

     - =*log-loadable-processing*= ::

     - =*log-platform-processing*= ::

     - =*log-state-changes*= ::

     - =*log-stream*= ::
       Global log stream for the whole debugger.

     - =*log-system-configuration*= ::

     - =*log-tap-register-access*= ::

     - =*map-to-zeroth-page*= ::

     - =*memory-detection-threshold*= ::

     - =*orgify*= ::

     - =*print-backtrace-on-errors*= ::

     - =*verbose-interface-init*= ::

     - =*watch*= ::

     - =*watch-fn*= ::

*** Документация
     - ? what ::
       Вывести справку по связанной с символом WHAT командой или категорией команд.

     - help &optional what ::
       Вывести справку по связанной с символом WHAT командой или категорией команд, 
       если он задан.  Если WHAT не указан, вывести перечень категорий.

     - apropos string-designator &optional package external-only ::
       Коротко описать все символы содержащие указанную STRING.
       Если указан PACKAGE, то описать лишь символы присутствующие в этом пакете.  
       Если указан EXTERNAL-ONLY, тогда описывать только символы эскпортируемые данным пакетом.

     - describe object &optional (stream-designator =*standard-output*=) ::
       Вывести описание OBJECT.

