doc/comdb-notes-ru.html

<div id="outline-container-6.2.5" class="outline-4">
<h4 id="sec-6.2.5"><span class="section-number-4">6.2.5</span> Примеры обычных лямбда-списков </h4>
<div class="outline-text-4" id="text-6.2.5">

<p>Вот несколько примеров использующих опциональные и остаточные параметра:
</p>



<pre class="src src-emacs-lisp">
  ((<span style="color: #00ffff;">lambda</span> (a b)
     (+ a (* b 3)))
   4 5)
 =&gt;  19
</pre>





<pre class="src src-emacs-lisp">
  ((<span style="color: #00ffff;">lambda</span> (a <span style="color: #98fb98;">&amp;optional</span> (b 2))
     (+ a (* b 3)))
   4 5)
 =&gt;  19
</pre>





<pre class="src src-emacs-lisp">
  ((<span style="color: #00ffff;">lambda</span> (a <span style="color: #98fb98;">&amp;optional</span> (b 2))
     (+ a (* b 3)))
   4)
 =&gt;  10
</pre>




<p>
Вот несколько примеров использующих ключевые параметры:
</p>



<pre class="src src-emacs-lisp">
  ((<span style="color: #00ffff;">lambda</span> (a b <span style="color: #98fb98;">&amp;key</span> c d)
     (list a b c d))
   1 2)
 =&gt;  (1 2 NIL NIL)
</pre>





<pre class="src src-emacs-lisp">
  ((<span style="color: #00ffff;">lambda</span> (a b <span style="color: #98fb98;">&amp;key</span> c d)
     (list a b c d))
   1 2 <span style="color: #b0c4de;">:c</span> 6)
 =&gt;  (1 2 6 NIL)
</pre>





<pre class="src src-emacs-lisp">
  ((<span style="color: #00ffff;">lambda</span> (a b <span style="color: #98fb98;">&amp;key</span> c d)
     (list a b c d))
   1 2 <span style="color: #b0c4de;">:d</span> 8)
 =&gt;  (1 2 NIL 8)
</pre>





<pre class="src src-emacs-lisp">
  ((<span style="color: #00ffff;">lambda</span> (a b <span style="color: #98fb98;">&amp;key</span> c d)
     (list a b c d))
   1 2 <span style="color: #b0c4de;">:c</span> 6 <span style="color: #b0c4de;">:d</span> 8)
 =&gt;  (1 2 6 8)
</pre>





<pre class="src src-emacs-lisp">
  ((<span style="color: #00ffff;">lambda</span> (a b <span style="color: #98fb98;">&amp;key</span> c d)
     (list a b c d))
   1 2 <span style="color: #b0c4de;">:d</span> 8 <span style="color: #b0c4de;">:c</span> 6)
 =&gt;  (1 2 6 8)
</pre>





<pre class="src src-emacs-lisp">
  ((<span style="color: #00ffff;">lambda</span> (a b <span style="color: #98fb98;">&amp;key</span> c d)
     (list a b c d))
   <span style="color: #b0c4de;">:a</span> 1 <span style="color: #b0c4de;">:d</span> 8 <span style="color: #b0c4de;">:c</span> 6)
 =&gt;  (<span style="color: #b0c4de;">:a</span> 1 6 8)
</pre>





<pre class="src src-emacs-lisp">
  ((<span style="color: #00ffff;">lambda</span> (a b <span style="color: #98fb98;">&amp;key</span> c d)
     (list a b c d))
   <span style="color: #b0c4de;">:a</span> <span style="color: #b0c4de;">:b</span> <span style="color: #b0c4de;">:c</span> <span style="color: #b0c4de;">:d</span>)
 =&gt;  (<span style="color: #b0c4de;">:a</span> <span style="color: #b0c4de;">:b</span> <span style="color: #b0c4de;">:d</span> NIL)
</pre>




<p>
Вот несколько примеров использующих опциональные, остаточные и ключевые параметры вместе:
</p>



<pre class="src src-emacs-lisp">
  ((<span style="color: #00ffff;">lambda</span> (a <span style="color: #98fb98;">&amp;optional</span> (b 3) <span style="color: #98fb98;">&amp;rest</span> x <span style="color: #98fb98;">&amp;key</span> c (d a))
     (list a b c d x))
   1)
 =&gt;  (1 3 NIL 1 ())
</pre>





<pre class="src src-emacs-lisp">
  ((<span style="color: #00ffff;">lambda</span> (a <span style="color: #98fb98;">&amp;optional</span> (b 3) <span style="color: #98fb98;">&amp;rest</span> x <span style="color: #98fb98;">&amp;key</span> c (d a))
     (list a b c d x))
   1 2)
 =&gt;  (1 2 NIL 1 ())
</pre>





<pre class="src src-emacs-lisp">
  ((<span style="color: #00ffff;">lambda</span> (a <span style="color: #98fb98;">&amp;optional</span> (b 3) <span style="color: #98fb98;">&amp;rest</span> x <span style="color: #98fb98;">&amp;key</span> c (d a))
     (list a b c d x))
   <span style="color: #b0c4de;">:c</span> 7)
 =&gt;  (<span style="color: #b0c4de;">:c</span> 7 NIL <span style="color: #b0c4de;">:c</span> ())
</pre>





<pre class="src src-emacs-lisp">
  ((<span style="color: #00ffff;">lambda</span> (a <span style="color: #98fb98;">&amp;optional</span> (b 3) <span style="color: #98fb98;">&amp;rest</span> x <span style="color: #98fb98;">&amp;key</span> c (d a))
     (list a b c d x))
   1 6 <span style="color: #b0c4de;">:c</span> 7)
 =&gt;  (1 6 7 1 (<span style="color: #b0c4de;">:c</span> 7))
</pre>





<pre class="src src-emacs-lisp">
  ((<span style="color: #00ffff;">lambda</span> (a <span style="color: #98fb98;">&amp;optional</span> (b 3) <span style="color: #98fb98;">&amp;rest</span> x <span style="color: #98fb98;">&amp;key</span> c (d a))
     (list a b c d x))
   1 6 <span style="color: #b0c4de;">:d</span> 8)
 =&gt;  (1 6 NIL 8 (<span style="color: #b0c4de;">:d</span> 8))
</pre>





<pre class="src src-emacs-lisp">
  ((<span style="color: #00ffff;">lambda</span> (a <span style="color: #98fb98;">&amp;optional</span> (b 3) <span style="color: #98fb98;">&amp;rest</span> x <span style="color: #98fb98;">&amp;key</span> c (d a))
     (list a b c d x))
   1 6 <span style="color: #b0c4de;">:d</span> 8 <span style="color: #b0c4de;">:c</span> 9 <span style="color: #b0c4de;">:d</span> 10)
 =&gt;  (1 6 9 8 (<span style="color: #b0c4de;">:d</span> 8 <span style="color: #b0c4de;">:c</span> 9 <span style="color: #b0c4de;">:d</span> 10))
</pre>





</div>
</div>

</div>

<div id="outline-container-6.3" class="outline-3">
<h3 id="sec-6.3"><span class="section-number-3">6.3</span> Управляющие переменные </h3>
<div class="outline-text-3" id="text-6.3">

<dl>
<dt><code>*disable-usb*</code></dt><dd>


</dd>
<dt><code>*display*</code></dt><dd>


</dd>
<dt><code>*examine-tlb*</code></dt><dd>


</dd>
<dt><code>*explain*</code></dt><dd>


</dd>
<dt><code>*force-memory-detection*</code></dt><dd>


</dd>
<dt><code>*forced-platform*</code></dt><dd>


</dd>
<dt><code>*inhibit-memory-detection*</code></dt><dd>


</dd>
<dt><code>*keep-target-intact*</code></dt><dd>


</dd>
<dt><code>*log-bus-events*</code></dt><dd>


</dd>
<dt><code>*log-core-pipeline-crit*</code></dt><dd>


</dd>
<dt><code>*log-graft-access*</code></dt><dd>


</dd>
<dt><code>*log-interface-bus-discovery*</code></dt><dd>


</dd>
<dt><code>*log-loadable-processing*</code></dt><dd>


</dd>
<dt><code>*log-platform-processing*</code></dt><dd>


</dd>
<dt><code>*log-state-changes*</code></dt><dd>


</dd>
<dt><code>*log-stream*</code></dt><dd>

<p>
Global log stream for the whole debugger.
</p>
</dd>
<dt><code>*log-system-configuration*</code></dt><dd>


</dd>
<dt><code>*log-tap-register-access*</code></dt><dd>


</dd>
<dt><code>*map-to-zeroth-page*</code></dt><dd>


</dd>
<dt><code>*memory-detection-threshold*</code></dt><dd>


</dd>
<dt><code>*orgify*</code></dt><dd>


</dd>
<dt><code>*print-backtrace-on-errors*</code></dt><dd>


</dd>
<dt><code>*verbose-interface-init*</code></dt><dd>


</dd>
<dt><code>*watch*</code></dt><dd>


</dd>
<dt><code>*watch-fn*</code></dt><dd>


</dd>
</dl>
</div>

</div>

<div id="outline-container-6.4" class="outline-3">
<h3 id="sec-6.4"><span class="section-number-3">6.4</span> Документация </h3>
<div class="outline-text-3" id="text-6.4">

<dl>
<dt>? what</dt><dd>

<p>
Вывести справку по связанной с символом WHAT командой или категорией команд.
</p>
</dd>
<dt>help &amp;optional what</dt><dd>

<p>
Вывести справку по связанной с символом WHAT командой или категорией команд, 
если он задан.  Если WHAT не указан, вывести перечень категорий.
</p>
</dd>
<dt>apropos string-designator &amp;optional package external-only</dt><dd>

<p>
Коротко описать все символы содержащие указанную STRING.
Если указан PACKAGE, то описать лишь символы присутствующие в этом пакете.  
Если указан EXTERNAL-ONLY, тогда описывать только символы эскпортируемые данным пакетом.
</p>
</dd>
<dt>describe object &amp;optional (stream-designator <code>*standard-output*</code>)</dt><dd>

<p>
Вывести описание OBJECT.
</p>
</dd>
</dl>
</div>

</div>
