doc/comdb-notes-ru.org
*** Устройства
     - scan &optional force-rescan ::
       Функция производит следующие операции:
       
         - поиск адаптеров подключенных к EPP и USB,
         - для каждого подключенного адаптера:
           - анализ OnCD подключенного к адаптеру целевого устройства,
           - определение типа платформы целевого устройства,
           - инициализацию компонентов платформы целевого устройства.
       
       Если функции первым параметром передан не-NIL, то производится повторный анализ
       уже найденных к данному моменту адаптеров с подключенными к ним целевыми устройствами.
       
       При нескольких подключенных устройствах, активным становится последнее найденное.
       При этом, следует отметить что шина USB сканируется после портов EPP, что, как следствие,
       придаёт адаптерам на шине USB определённый приоритет.

     - compile-memconfig name ::
       Вывести список пар адрес-значение соответствующих названной конфигурации памяти.

     - list-memconfigs ::
       Вывести список имён конфигураций памяти потенциально применимых
       к текущему целевому устройству.

     - set-memconfig name &key test (test-size 10000) remember ::
       Применить конфигурацию памяти с именем NAME.
       
       Принимаются следующие ключевые аргументы:
         - TEST ::
           По применении конфигурации проверить её работоспособность,
           произведя тест памяти.
         - TEST-SIZE ::
           Задать размер тестирования.
         - REMEMBER ::
           Запомнить данную конфигурацию для активного целевого устройства,
           что приведёт к её использованию во время перенастройки при сбросе.

     - explain-memconfig &optional name ::
       Детально, по битовым полям, разобрать структуру конфигурации памяти
       с именем NAME.  Если имя не указано, разобрать текущую настройку.

     - list-contexts ::
       Вывести список контекстов обнаруженных целевых устройств.

     - ctx &optional id ::
       При отсутствии параметров, вывести список целевых контекстов,
       содержащийся в переменной =*TARGET-CONTEXTS*=.
       При наличии параметра, интерпретировать его как номер контекста,
       если это число, либо идентификатор контекста, если это список,
       который следует сделать теукщим.

*** Ввод/вывод
     - clearmem address length &optional (value 0) ::
       Установить диапазон ячеек памяти начиная с ADDRESS и длиной LENGTH
       байт в значение параметра VALUE (0-255).

     - loadelf filename &key check ::
       Загрузить содержимое FILENAME в формате ELF в память устройства
       и установить точку входа.
       
       Принимаются следующие ключевые аргументы:
         - CHECK ::
           включить проверку целостности записи.

     - loadbin filename address &key check ::
       Загрузить сырые байты из FILENAME по ADDRESS.
       
       Принимаются следующие ключевые аргументы:
         - CHECK ::
           включить проверку целостности записи.

     - savebin filename address length ::
       Сохранить содержимое диапазона ячеек памяти начиная с ADDRESS
       и длиной LENGTH байт в FILENAME, в сыром виде.

     - loadeltext filename &key (entry-point bfc00000) check ::
       Загрузить содержимое FILENAME в текстовом формате 'eltext' в память
       устройства и установить точку входа.
       
       Принимаются следующие ключевые аргументы:
         - CHECK ::
           включить проверку целостности записи.
       
         - ENTRY-POINT ::
           установить точку входа.

     - saveeltext filename address length ::
       Сохранить содержимое диапазона ячеек памяти начиная с ADDRESS и
       длиной LENGTH байт в FILENAME, в формате 'eltext'.
       
       ADDRESS и LENGTH должны быть выровнены по 16.

     - loadldr filename &key check ::
       Загрузить содержимое FILENAME в формате LDR-MCS в память устройства
       и установить точку входа.
       
       Принимаются следующие ключевые аргументы:
         - CHECK ::
           включить проверку целостности записи.

