doc/comdb-notes-ru.html

<div id="outline-container-6.5" class="outline-3">
<h3 id="sec-6.5"><span class="section-number-3">6.5</span> Устройства </h3>
<div class="outline-text-3" id="text-6.5">

<dl>
<dt>scan &amp;optional force-rescan</dt><dd>

<p>
Функция производит следующие операции:
</p>
<ul>
<li>
поиск адаптеров подключенных к EPP и USB,
</li>
<li>
для каждого подключенного адаптера:
<ul>
<li>
анализ OnCD подключенного к адаптеру целевого устройства,
</li>
<li>
определение типа платформы целевого устройства,
</li>
<li>
инициализацию компонентов платформы целевого устройства.

</li>
</ul>
</li>
</ul>

<p>Если функции первым параметром передан не-NIL, то производится повторный анализ
уже найденных к данному моменту адаптеров с подключенными к ним целевыми устройствами.
</p>
<p>
При нескольких подключенных устройствах, активным становится последнее найденное.
При этом, следует отметить что шина USB сканируется после портов EPP, что, как следствие,
придаёт адаптерам на шине USB определённый приоритет.
</p>
</dd>
<dt>compile-memconfig name</dt><dd>

<p>
Вывести список пар адрес-значение соответствующих названной конфигурации памяти.
</p>
</dd>
<dt>list-memconfigs</dt><dd>

<p>
Вывести список имён конфигураций памяти потенциально применимых
к текущему целевому устройству.
</p>
</dd>
<dt>set-memconfig name &amp;key test (test-size 10000) remember</dt><dd>

<p>
Применить конфигурацию памяти с именем NAME.
</p>
<p>
Принимаются следующие ключевые аргументы:
</p><dl>
<dt>TEST</dt><dd>

<p>
По применении конфигурации проверить её работоспособность,
произведя тест памяти.
</p></dd>
<dt>TEST-SIZE</dt><dd>

<p>
Задать размер тестирования.
</p></dd>
<dt>REMEMBER</dt><dd>

<p>
Запомнить данную конфигурацию для активного целевого устройства,
что приведёт к её использованию во время перенастройки при сбросе.
</p>
</dd>
</dl>
</dd>
<dt>explain-memconfig &amp;optional name</dt><dd>

<p>
Детально, по битовым полям, разобрать структуру конфигурации памяти
с именем NAME.  Если имя не указано, разобрать текущую настройку.
</p>
</dd>
<dt>list-contexts</dt><dd>

<p>
Вывести список контекстов обнаруженных целевых устройств.
</p>
</dd>
<dt>ctx &amp;optional id</dt><dd>

<p>
При отсутствии параметров, вывести список целевых контекстов,
содержащийся в переменной <code>*TARGET-CONTEXTS*</code>.
При наличии параметра, интерпретировать его как номер контекста,
если это число, либо идентификатор контекста, если это список,
который следует сделать теукщим.
</p>
</dd>
</dl>
</div>

</div>

<div id="outline-container-6.6" class="outline-3">
<h3 id="sec-6.6"><span class="section-number-3">6.6</span> Ввод/вывод </h3>
<div class="outline-text-3" id="text-6.6">

<dl>
<dt>clearmem address length &amp;optional (value 0)</dt><dd>

<p>
Установить диапазон ячеек памяти начиная с ADDRESS и длиной LENGTH
байт в значение параметра VALUE (0-255).
</p>
</dd>
<dt>loadelf filename &amp;key check</dt><dd>

<p>
Загрузить содержимое FILENAME в формате ELF в память устройства
и установить точку входа.
</p>
<p>
Принимаются следующие ключевые аргументы:
</p><dl>
<dt>CHECK</dt><dd>

<p>
включить проверку целостности записи.
</p>
</dd>
</dl>
</dd>
<dt>loadbin filename address &amp;key check</dt><dd>

<p>
Загрузить сырые байты из FILENAME по ADDRESS.
</p>
<p>
Принимаются следующие ключевые аргументы:
</p><dl>
<dt>CHECK</dt><dd>

<p>
включить проверку целостности записи.
</p>
</dd>
</dl>
</dd>
<dt>savebin filename address length</dt><dd>

<p>
Сохранить содержимое диапазона ячеек памяти начиная с ADDRESS
и длиной LENGTH байт в FILENAME, в сыром виде.
</p>
</dd>
<dt>loadeltext filename &amp;key (entry-point bfc00000) check</dt><dd>

<p>
Загрузить содержимое FILENAME в текстовом формате 'eltext' в память
устройства и установить точку входа.
</p>
<p>
Принимаются следующие ключевые аргументы:
</p><dl>
<dt>CHECK</dt><dd>

<p>
включить проверку целостности записи.
</p>
</dd>
<dt>ENTRY-POINT</dt><dd>

<p>
установить точку входа.
</p>
</dd>
</dl>
</dd>
<dt>saveeltext filename address length</dt><dd>

<p>
Сохранить содержимое диапазона ячеек памяти начиная с ADDRESS и
длиной LENGTH байт в FILENAME, в формате 'eltext'.
</p>
<p>
ADDRESS и LENGTH должны быть выровнены по 16.
</p>
</dd>
<dt>loadldr filename &amp;key check</dt><dd>

<p>
Загрузить содержимое FILENAME в формате LDR-MCS в память устройства
и установить точку входа.
</p>
<p>
Принимаются следующие ключевые аргументы:
</p><dl>
<dt>CHECK</dt><dd>

<p>
включить проверку целостности записи.
</p>
</dd>
</dl>
</dd>
</dl>
</div>

</div>
