doc/comdb-notes-ru.org
*** Управление состоянием
     - reset &rest platform-args &key (core =*core*=) (state =*depth*=) &allow-other-keys ::
       Функция сбрасывает и перенастраивает целевое устройство содержащее ядро CORE
        (по умолчанию выбирается являющееся активным в данный момент), с учётом ключевых аргументов PLATFORM-ARGS.
       Производятся следующие действия:
       
         * осуществляется попытка выяснения текущие значения делителей частоты;
         * кристалл сбрасывается в первоначальное состояние;
         * системные компоненты перенастраиваются с использованием либо сохранённых значений
           делителей частоты, либо значений по умолчанию для данной платформы.
         * устанавливается соответствующая текущим настройкам глубина режима отладки (по умолчанию – :DEBUG).

     - dive ::
       Войти в более глубокий режим отладки, или остановить целевое устройство.
       Схема состояний: :FREE -> :STEP -> :DEBUG.

     - rise ::
       Войти в более лёгкий режим отладки, или запустить целевое устройство.
       Схема состояний :DEBUG -> :STEP -> :FREE.

     - run &rest params &key (core =*core*=) (explain =*explain*=) (display =*display*=) (watch =*watch*=) (watch-fn =*watch-fn*=) (iteration-period 989680) (watch-period 64) &allow-other-keys ::
       Вывести ядро CORE из режима отладки, запустить его, дождаться его останова
       и войти в режим отладки.
       
       Принимаются следующие ключевые аргументы:
         - ADDRESS ::
           заместить содержимое регистра адреса выбираемой инструкции,
           и как следствие, перевести поток исполнения на заданный адрес.

     - run-async &rest params &key address state-determined (core =*core*=) &allow-other-keys ::
       Вывести целевое устройство из режима отладки и запустить его асинхронно,
       не дожидаясь.
       
       Принимаются следующие ключевые аргументы:
         - ADDRESS ::
           заместить содержимое регистра адреса выбираемой инструкции,
           и как следствие, перевести поток исполнения на заданный адрес.

     - run-until-stopped-by reason &rest run-params &key (otherwise :report-and-continue) &allow-other-keys ::
       Запустить кристалл, дождаться останова, анализируя затем его причину и
       возвращая успех при совпадении причины со значением параметра REASON.
       Реакция на несовпадение определяется значением ключевого параметра OTHERWISE,
       интерпретируемого следующим образом:
         - :RETURN ::
           вернуть ложный статус,
         - :CONTINUE ::
           продолжить цикл,
         - :REPORT-AND-CONTINUE :: 
           продолжить цикл, отобразив причину останова.
       
       Остаточные параметры (за исключением OTHERWISE) передаются команде RUN.

     - run-while-boring &rest boring-syms ::
       Запустить целевое устройство, продолжая затем запускать его, при остановах,
       до тех пор пока при очередном останове на конвейере не появятся адреса не покрытые
       символами из остаточного списка параметров.

     - run-while-step-in address &optional (nsteps 1) verbose &key (explain =*explain*=) (display =*display*=) ::
       Запустить целевое устройство, осуществляя NSTEPS шагов при остановах и
       проводя сравнение регистра адреса выбираемой инструкции со значением параметра
       ADDRESS, запуская кристалл дальше, в цикле, если сравнение успешно, и выходя
       из цикла в обратном случае.

     - step count &key (display =*display*=) ::
       Произвести COUNT шагов.

     - trace count &rest run-params ::
       Исполнить COUNT инструкций и остановиться.
       
       Остаточные параметры передаются команде RUN.

     - dspreset dsp-core-or-id ::
       Произвести аппаратный сброс DSP-ядра заданного через спецификатор DSP-ядра DSP-CORE-OR-ID.
       
       Примеры:
         : (dspreset (dsp 0))
         : (dspreset 0)

     - dsprun dsp-core-or-id &optional address ::
       Запустить DSP-ядро заданное через спецификатор DSP-ядра DSP-CORE-OR-ID с ADDRESS, 
       если он указан, либо просто продолжить поток исполнения, не вмешиваясь в конвейер,
       если ADDRESS не указан.  В любом случае, дождаться останова DSP-ядра.
       
       Примеры:
         : (dsprun (dsp 0) #x1010)
         : (dsprun 0 #x1010)

     - dspstep dsp-core-or-id &optional (count 1) ::
       Произвести COUNT шагов в DSP-ядре заданном через спецификатор DSP-ядра DSP-CORE-OR-ID.
       
       Примеры:
         : (dspstep (dsp 0))

     - dspstop dsp-core-or-id ::
       Ввести DSP-ядро заданное через спецификатор DSP-ядра DSP-CORE-OR-ID в режим останова.
       
       Примеры:
         : (dspstop (dsp 0))

     - explain &optional (core =*core*=) ::
       Отобразить причину останова ядра CORE.
       По умолчанию используется ядро текущего активного устройства.

     - leave-frame &rest run-params ::
       Установить точку останова в значение регистра R31, предположительно
       содержащий актуальный адрес возврата и выполнить команду RUN.
       
       Остаточные параметры передаются команде RUN.

