doc/comdb-notes-ru.html

<div id="outline-container-6.7" class="outline-3">
<h3 id="sec-6.7"><span class="section-number-3">6.7</span> Управление состоянием </h3>
<div class="outline-text-3" id="text-6.7">

<dl>
<dt>reset &amp;rest platform-args &amp;key (core <code>*core*</code>) (state <code>*depth*</code>) &amp;allow-other-keys</dt><dd>

<p>
Функция сбрасывает и перенастраивает <a href="#целевое==устройство">целевое устройство</a> содержащее ядро CORE
(по умолчанию выбирается являющееся активным в данный момент), с учётом ключевых аргументов PLATFORM-ARGS.
Производятся следующие действия:
</p>
<ul>
<li>
осуществляется попытка выяснения текущие значения делителей частоты;
</li>
<li>
кристалл сбрасывается в первоначальное состояние;
</li>
<li>
системные компоненты перенастраиваются с использованием либо сохранённых значений
делителей частоты, либо значений по умолчанию для данной платформы.
</li>
<li>
устанавливается соответствующая текущим настройкам глубина режима отладки (по умолчанию – :DEBUG).

</li>
</ul>
</dd>
<dt>dive</dt><dd>

<p>
Войти в более глубокий режим отладки, или остановить <a href="#целевое==устройство">целевое устройство</a>.
Схема состояний: :FREE -&gt; :STEP -&gt; :DEBUG.
</p>
</dd>
<dt>rise</dt><dd>

<p>
Войти в более лёгкий режим отладки, или запустить <a href="#целевое==устройство">целевое устройство</a>.
Схема состояний :DEBUG -&gt; :STEP -&gt; :FREE.
</p>
</dd>
<dt>run &amp;rest params &amp;key (core <code>*core*</code>) (explain <code>*explain*</code>) (display <code>*display*</code>) (watch <code>*watch*</code>) (watch-fn <code>*watch-fn*</code>) (iteration-period 989680) (watch-period 64) &amp;allow-other-keys</dt><dd>

<p>
Вывести ядро CORE из режима отладки, запустить его, дождаться его останова
и войти в режим отладки.
</p>
<p>
Принимаются следующие ключевые аргументы:
</p><dl>
<dt>ADDRESS</dt><dd>

<p>
заместить содержимое регистра адреса выбираемой инструкции,
и как следствие, перевести поток исполнения на заданный адрес.
</p>
</dd>
</dl>
</dd>
<dt>run-async &amp;rest params &amp;key address state-determined (core <code>*core*</code>) &amp;allow-other-keys</dt><dd>

<p>
Вывести <a href="#целевое==устройство">целевое устройство</a> из режима отладки и запустить его асинхронно,
не дожидаясь.
</p>
<p>
Принимаются следующие ключевые аргументы:
</p><dl>
<dt>ADDRESS</dt><dd>

<p>
заместить содержимое регистра адреса выбираемой инструкции,
и как следствие, перевести поток исполнения на заданный адрес.
</p>
</dd>
</dl>
</dd>
<dt>run-until-stopped-by reason &amp;rest run-params &amp;key (otherwise :report-and-continue) &amp;allow-other-keys</dt><dd>

<p>
Запустить кристалл, дождаться останова, анализируя затем его причину и
возвращая успех при совпадении причины со значением параметра REASON.
Реакция на несовпадение определяется значением ключевого параметра OTHERWISE,
интерпретируемого следующим образом:
</p><dl>
<dt>:RETURN</dt><dd>

<p>
вернуть ложный статус,
</p></dd>
<dt>:CONTINUE</dt><dd>

<p>
продолжить цикл,
</p></dd>
<dt>:REPORT-AND-CONTINUE</dt><dd>

<p>
продолжить цикл, отобразив причину останова.
</p>
</dd>
</dl>

<p>Остаточные параметры (за исключением OTHERWISE) передаются команде RUN.
</p>
</dd>
<dt>run-while-boring &amp;rest boring-syms</dt><dd>

<p>
Запустить <a href="#целевое==устройство">целевое устройство</a>, продолжая затем запускать его, при остановах,
до тех пор пока при очередном останове на конвейере не появятся адреса не покрытые
символами из остаточного списка параметров.
</p>
</dd>
<dt>run-while-step-in address &amp;optional (nsteps 1) verbose &amp;key (explain <code>*explain*</code>) (display <code>*display*</code>)</dt><dd>

<p>
Запустить <a href="#целевое==устройство">целевое устройство</a>, осуществляя NSTEPS шагов при остановах и
проводя сравнение регистра адреса выбираемой инструкции со значением параметра
ADDRESS, запуская кристалл дальше, в цикле, если сравнение успешно, и выходя
из цикла в обратном случае.
</p>
</dd>
<dt>step count &amp;key (display <code>*display*</code>)</dt><dd>

<p>
Произвести COUNT шагов.
</p>
</dd>
<dt>trace count &amp;rest run-params</dt><dd>

<p>
Исполнить COUNT инструкций и остановиться.
</p>
<p>
Остаточные параметры передаются команде RUN.
</p>
</dd>
<dt>dspreset dsp-core-or-id</dt><dd>

<p>
Произвести аппаратный сброс DSP-ядра заданного через <a href="#спецификатор==DSP-ядра">спецификатор DSP-ядра</a> DSP-CORE-OR-ID.
</p>
<p>
Примеры:
</p><pre class="example">
(dspreset (dsp 0))
(dspreset 0)
</pre>


</dd>
<dt>dsprun dsp-core-or-id &amp;optional address</dt><dd>

<p>
Запустить DSP-ядро заданное через <a href="#спецификатор==DSP-ядра">спецификатор DSP-ядра</a> DSP-CORE-OR-ID с ADDRESS, 
если он указан, либо просто продолжить поток исполнения, не вмешиваясь в конвейер,
если ADDRESS не указан.  В любом случае, дождаться останова DSP-ядра.
</p>
<p>
Примеры:
</p><pre class="example">
(dsprun (dsp 0) #x1010)
(dsprun 0 #x1010)
</pre>


</dd>
<dt>dspstep dsp-core-or-id &amp;optional (count 1)</dt><dd>

<p>
Произвести COUNT шагов в DSP-ядре заданном через <a href="#спецификатор==DSP-ядра">спецификатор DSP-ядра</a> DSP-CORE-OR-ID.
</p>
<p>
Примеры:
</p><pre class="example">
(dspstep (dsp 0))
</pre>


</dd>
<dt>dspstop dsp-core-or-id</dt><dd>

<p>
Ввести DSP-ядро заданное через <a href="#спецификатор==DSP-ядра">спецификатор DSP-ядра</a> DSP-CORE-OR-ID в режим останова.
</p>
<p>
Примеры:
</p><pre class="example">
(dspstop (dsp 0))
</pre>


</dd>
<dt>explain &amp;optional (core <code>*core*</code>)</dt><dd>

<p>
Отобразить причину останова ядра CORE.
По умолчанию используется ядро текущего активного устройства.
</p>
</dd>
<dt>leave-frame &amp;rest run-params</dt><dd>

<p>
Установить точку останова в значение регистра R31, предположительно
содержащий актуальный адрес возврата и выполнить команду RUN.
</p>
<p>
Остаточные параметры передаются команде RUN.
</p>
</dd>
</dl>
</div>

</div>
