doc/comdb-notes-ru.org
*** Ловушки
     - hw-break break-or-id address &optional (skipcount 0) &key bound ::
       Установить аппаратную точку останова заданную через спецификатор
       аппаратной точки останова BREAK-OR-ID на адрес заданный через спецификатор
       адреса ADDRESS. Опциональный параметр SKIPCOUNT задаёт количество пропусков
       срабатывания.

     - sw-break address-or-symbol ::
       Установить программную точку останова на адрес заданный через
       спецификатор адреса ADDRESS-OR-SYMBOL.

     - watch break-or-id address &optional (skipcount 0) &key (read t) write bound ::
       Установить адресную ловушку точку заданную через спецификатор
       аппаратной точки останова BREAK-OR-ID на адрес заданный через спецификатор
       адреса ADDRESS. Опциональный параметр SKIPCOUNT задаёт количество пропусков
       срабатывания.

     - catch &rest catches ::
       Проинтерпретировать остаточный список параметров как набор спецификаторов
       векторных ловушек, и установить их. Интерпретация осуществляется следующим образом:
       
         - #xbfc00000, #xbfc, :bfc  ->  #xbfc00000
         - #x80000000, #x800, :800  ->  #x80000000
         - #x80000180, #x180, :180  ->  #x80000180
         - #x80000200, #x200, :200  ->  #x80000200
         - #xbfc00200  ->  #xbfc00200
         - #xbfc00380, #x380, :380  ->  #xbfc00380
         - #xbfc00400, #x400, :400  ->  #xbfc00400

     - trace count &rest run-params ::
       Исполнить COUNT инструкций и остановиться.
       
       Остаточные параметры передаются команде RUN.

     - settrace count ::
       Установить ограничитель количества исполняемых инструкций в COUNT.

     - clear-break address ::
       Удалить точку останова, будь то программную или аппаратную, установленную
       на ADDRESS.

     - clear-sw-breaks ::
       Удалить все программные точки останова.

     - disable-breaks ::
       Отключить все точки останова.

     - describe-breaks ::
       Описать все активные точки останова.

     - dspbreak dsp-core-or-id n address ::
       Установить N-ную точку останова DSP-ядра заданного через спецификатор DSP-ядра
       DSP-CORE-OR-ID в ADDRESS, если последний не-NIL.  В противном случае, отключить её.
       
       Примеры:
         : (dspbreak (dsp 0) 3 #x1010)
         : (dspbreak 0 3 #x1010)

*** DSP
     - dsp n ::
       Вернуть объект представляющий N-ное DSP-ядро.

     - dspbreak dsp-core-or-id n address ::
       Установить N-ную точку останова DSP-ядра заданного через спецификатор DSP-ядра
       DSP-CORE-OR-ID в ADDRESS, если последний не-NIL.  В противном случае, отключить её.
       
       Примеры:
         : (dspbreak (dsp 0) 3 #x1010)
         : (dspbreak 0 3 #x1010)

     - dspreset dsp-core-or-id ::
       Произвести аппаратный сброс DSP-ядра заданного через спецификатор DSP-ядра DSP-CORE-OR-ID.
       
       Примеры:
         : (dspreset (dsp 0))
         : (dspreset 0)

     - dsprun dsp-core-or-id &optional address ::
       Запустить DSP-ядро заданное через спецификатор DSP-ядра DSP-CORE-OR-ID с ADDRESS, 
       если он указан, либо просто продолжить поток исполнения, не вмешиваясь в конвейер,
       если ADDRESS не указан.  В любом случае, дождаться останова DSP-ядра.
       
       Примеры:
         : (dsprun (dsp 0) #x1010)
         : (dsprun 0 #x1010)

     - dspstep dsp-core-or-id &optional (count 1) ::
       Произвести COUNT шагов в DSP-ядре заданном через спецификатор DSP-ядра DSP-CORE-OR-ID.
       
       Примеры:
         : (dspstep (dsp 0))

     - dspstop dsp-core-or-id ::
       Ввести DSP-ядро заданное через спецификатор DSP-ядра DSP-CORE-OR-ID в режим останова.
       
       Примеры:
         : (dspstop (dsp 0))

*** Адреса и символы
     - addr address-or-symbol ::
       Проанализировать адрес заданный через спецификатор адреса ADDRESS-OR-SYMBOL,
       и выдать детальную информацию.

     - addrsym address ::
       Вернуть символ с наименьшим адресом, большим или равным ADDRESS.

     - nextaddr address ::
       Вернуть адрес символа следующего за ADDRESS в активной таблице символов.

     - nextsym symbol ::
       Вернуть символ следующий в активной таблице символов за SYMBOL.

     - prevaddr address ::
       Вернуть адрес символа предшедствующего ADDRESS в активной таблице символов.

     - symaddr symbol ::
       Вернуть адрес соответствующий SYMBOL.

     - symlength symbol ::
       Вернуть разницу между адресами SYMBOL и символа следующего за ним
       в активной таблице символов.

     - loadsyms pathname &key (type :system-map) ::
       Загрузить таблицу символов в формате TYPE из файла PATHNAME,
       и сделать эту таблицу активной.

     - register-address register ::
       Найти адрес регистра соответствующего спецификатору регистра REGISTER,
       в том случае если он соответствует регистру отображённому в память.

