doc/comdb-notes-ru.html

<div id="outline-container-6.8" class="outline-3">
<h3 id="sec-6.8"><span class="section-number-3">6.8</span> Ловушки </h3>
<div class="outline-text-3" id="text-6.8">

<dl>
<dt>hw-break break-or-id address &amp;optional (skipcount 0) &amp;key bound</dt><dd>

<p>
Установить аппаратную точку останова заданную через <a href="#спецификатор==аппаратной==точки==останова">спецификатор аппаратной точки останова</a> BREAK-OR-ID на адрес заданный через <a href="#спецификатор==адреса">спецификатор адреса</a> ADDRESS. <a href="#sec-6.8">Опциональный параметр</a> SKIPCOUNT задаёт количество пропусков
срабатывания.
</p>
</dd>
<dt>sw-break address-or-symbol</dt><dd>

<p>
Установить программную точку останова на адрес заданный через
<a href="#спецификатор==адреса">спецификатор адреса</a> ADDRESS-OR-SYMBOL.
</p>
</dd>
<dt>watch break-or-id address &amp;optional (skipcount 0) &amp;key (read t) write bound</dt><dd>

<p>
Установить адресную ловушку точку заданную через <a href="#спецификатор==аппаратной==точки==останова">спецификатор аппаратной точки останова</a> BREAK-OR-ID на адрес заданный через <a href="#спецификатор==адреса">спецификатор адреса</a> ADDRESS. <a href="#sec-6.8">Опциональный параметр</a> SKIPCOUNT задаёт количество пропусков
срабатывания.
</p>
</dd>
<dt>catch &amp;rest catches</dt><dd>

<p>
Проинтерпретировать остаточный список параметров как набор спецификаторов
векторных ловушек, и установить их. Интерпретация осуществляется следующим образом:
</p>
<ul>
<li>
#xbfc00000, #xbfc, :bfc  -&gt;  #xbfc00000
</li>
<li>
#x80000000, #x800, :800  -&gt;  #x80000000
</li>
<li>
#x80000180, #x180, :180  -&gt;  #x80000180
</li>
<li>
#x80000200, #x200, :200  -&gt;  #x80000200
</li>
<li>
#xbfc00200  -&gt;  #xbfc00200
</li>
<li>
#xbfc00380, #x380, :380  -&gt;  #xbfc00380
</li>
<li>
#xbfc00400, #x400, :400  -&gt;  #xbfc00400

</li>
</ul>
</dd>
<dt>trace count &amp;rest run-params</dt><dd>

<p>
Исполнить COUNT инструкций и остановиться.
</p>
<p>
Остаточные параметры передаются команде RUN.
</p>
</dd>
<dt>settrace count</dt><dd>

<p>
Установить ограничитель количества исполняемых инструкций в COUNT.
</p>
</dd>
<dt>clear-break address</dt><dd>

<p>
Удалить точку останова, будь то программную или аппаратную, установленную
на ADDRESS.
</p>
</dd>
<dt>clear-sw-breaks</dt><dd>

<p>
Удалить все программные точки останова.
</p>
</dd>
<dt>disable-breaks</dt><dd>

<p>
Отключить все точки останова.
</p>
</dd>
<dt>describe-breaks</dt><dd>

<p>
Описать все активные точки останова.
</p>
</dd>
<dt>dspbreak dsp-core-or-id n address</dt><dd>

<p>
Установить N-ную точку останова DSP-ядра заданного через <a href="#спецификатор==DSP-ядра">спецификатор DSP-ядра</a>
DSP-CORE-OR-ID в ADDRESS, если последний не-NIL.  В противном случае, отключить её.
</p>
<p>
Примеры:
</p><pre class="example">
(dspbreak (dsp 0) 3 #x1010)
(dspbreak 0 3 #x1010)
</pre>


</dd>
</dl>
</div>

</div>

<div id="outline-container-6.9" class="outline-3">
<h3 id="sec-6.9"><span class="section-number-3">6.9</span> DSP </h3>
<div class="outline-text-3" id="text-6.9">

<dl>
<dt>dsp n</dt><dd>

<p>
Вернуть объект представляющий N-ное DSP-ядро.
</p>
</dd>
<dt>dspbreak dsp-core-or-id n address</dt><dd>

<p>
Установить N-ную точку останова DSP-ядра заданного через <a href="#спецификатор==DSP-ядра">спецификатор DSP-ядра</a>
DSP-CORE-OR-ID в ADDRESS, если последний не-NIL.  В противном случае, отключить её.
</p>
<p>
Примеры:
</p><pre class="example">
(dspbreak (dsp 0) 3 #x1010)
(dspbreak 0 3 #x1010)
</pre>


</dd>
<dt>dspreset dsp-core-or-id</dt><dd>

<p>
Произвести аппаратный сброс DSP-ядра заданного через <a href="#спецификатор==DSP-ядра">спецификатор DSP-ядра</a> DSP-CORE-OR-ID.
</p>
<p>
Примеры:
</p><pre class="example">
(dspreset (dsp 0))
(dspreset 0)
</pre>


</dd>
<dt>dsprun dsp-core-or-id &amp;optional address</dt><dd>

<p>
Запустить DSP-ядро заданное через <a href="#спецификатор==DSP-ядра">спецификатор DSP-ядра</a> DSP-CORE-OR-ID с ADDRESS, 
если он указан, либо просто продолжить поток исполнения, не вмешиваясь в конвейер,
если ADDRESS не указан.  В любом случае, дождаться останова DSP-ядра.
</p>
<p>
Примеры:
</p><pre class="example">
(dsprun (dsp 0) #x1010)
(dsprun 0 #x1010)
</pre>


</dd>
<dt>dspstep dsp-core-or-id &amp;optional (count 1)</dt><dd>

<p>
Произвести COUNT шагов в DSP-ядре заданном через <a href="#спецификатор==DSP-ядра">спецификатор DSP-ядра</a> DSP-CORE-OR-ID.
</p>
<p>
Примеры:
</p><pre class="example">
(dspstep (dsp 0))
</pre>


</dd>
<dt>dspstop dsp-core-or-id</dt><dd>

<p>
Ввести DSP-ядро заданное через <a href="#спецификатор==DSP-ядра">спецификатор DSP-ядра</a> DSP-CORE-OR-ID в режим останова.
</p>
<p>
Примеры:
</p><pre class="example">
(dspstop (dsp 0))
</pre>


</dd>
</dl>
</div>

</div>

<div id="outline-container-6.10" class="outline-3">
<h3 id="sec-6.10"><span class="section-number-3">6.10</span> Адреса и символы </h3>
<div class="outline-text-3" id="text-6.10">

<dl>
<dt>addr address-or-symbol</dt><dd>

<p>
Проанализировать адрес заданный через <a href="#спецификатор==адреса">спецификатор адреса</a> ADDRESS-OR-SYMBOL,
и выдать детальную информацию.
</p>
</dd>
<dt>addrsym address</dt><dd>

<p>
Вернуть <a href="#символ">символ</a> с наименьшим адресом, большим или равным ADDRESS.
</p>
</dd>
<dt>nextaddr address</dt><dd>

<p>
Вернуть адрес символа следующего за ADDRESS в активной таблице символов.
</p>
</dd>
<dt>nextsym symbol</dt><dd>

<p>
Вернуть <a href="#символ">символ</a> следующий в активной таблице символов за SYMBOL.
</p>
</dd>
<dt>prevaddr address</dt><dd>

<p>
Вернуть адрес символа предшедствующего ADDRESS в активной таблице символов.
</p>
</dd>
<dt>symaddr symbol</dt><dd>

<p>
Вернуть адрес соответствующий SYMBOL.
</p>
</dd>
<dt>symlength symbol</dt><dd>

<p>
Вернуть разницу между адресами SYMBOL и символа следующего за ним
в активной таблице символов.
</p>
</dd>
<dt>loadsyms pathname &amp;key (type :system-map)</dt><dd>

<p>
Загрузить таблицу символов в формате TYPE из файла PATHNAME,
и сделать эту таблицу активной.
</p>
</dd>
<dt>register-address register</dt><dd>

<p>
Найти адрес регистра соответствующего спецификатору регистра REGISTER,
в том случае если он соответствует регистру отображённому в память.
</p>
</dd>
</dl>
</div>

</div>
