doc/comdb-notes-ru.org
*** Анализ
     - disasm &optional address-or-symbol length line-pre-annotate-fn annotations ::
       Дизассемблировать содержимое диапазона ячеек памяти начиная с
       ADDRESS-OR-SYMBOL и длиной LENGTH.
       
       Значение параметра ADDRESS-OR-SYMBOL по умолчанию равно содержимому
       регистра адреса выборки конвейера уменьшенному на #x10.
       
       Значение параметра LENGTH по умолчанию равно либо #x20, если ADDRESS-OR-SYMBOL представляет собой целое,
       либо разнице между адресами символов ADDRESS-OR-SYMBOL и следующего за ним.

     - displash address &optional (splash-size 10) annotations ::
       Дизассемблирование адресов в коридоре вокруг ADDRESS.
       Величина коридора задаётся параметром SPLASH-SIZE.

     - dispack &optional (name :pipeline) ::
       Напечатать значения регистров из заготовленной пачки с именем NAME.

     - dump address-or-symbol &optional (length 100) ::
       Напечатать содержимое диапазона ячеек памяти начиная с ADDRESS-OR-SYMBOL
       и длиной LENGTH.

     - print-memory address length ::
       Напечатать содержимое диапазона ячеек памяти начиная с ADDRESS и
       длиной LENGTH, как текст.

     - print-tlb &optional (page-size 4000) ::
       Распечатать содержимое TLB.  Размер отображаемый страницей принимается
       равным PAGE-SIZE.

     - display &rest new-items ::
       Печатать значения регистров чьи имена находятся в /месте/
        (DISPLAY-LIST).  Когда команде передаются параметры, они замещают
       старое значение (DISPLAY-LIST).

     - edisplay ::
       Как DISPLAY, с добавлением типично востребованной информации:
       cop0.count, cop0.epc, cop0.badvaddr, cop0.cause и дизассемблированием
       адресов вокруг pcfetch и cop0.epc.

     - display-list ::
       /Место/ предоставляющее доступ к текущему списку отображения.

     - explain &optional (core =*core*=) ::
       Отобразить причину останова ядра CORE.
       По умолчанию используется ядро текущего активного устройства.

     - get name-or-address ::
       Получить регистр или ячейку памяти заданный/-ую через спецификатор адреса
       NAME-OR-ADDRESS, представляющем собой либо ключевое слово.

     - set name-or-address value ::
       Установить регистр или ячейку памяти заданный/-ую через спецификатор адреса
       NAME-OR-ADDRESS.  Также доступен синтаксис (setf (get NAME-OR-ADDRESS) VALUE).

     - peek address-or-symbol &optional verbose ::
       Напечатать содержимое ячейки по адресу ADDRESS-OR-SYMBOL, опционально,
       при указанном не-NIL значении параметра VERBOSE, расшифровывая значение
       ADDRESS-OR-SYMBOL в контексте активной таблицы символов.

     - show name-or-address ::
       Получить регистр или ячейку памяти заданный/-ую через спецификатор адреса
       NAME-OR-ADDRESS.  В том случае если указано имя регистра имеющего структуру,
       полученное значение разобирается по полям, и возвращается как второе значение
       функции.

     - pipeline ::
       Как DISPLAY, но анализирует лишь адреса на конвейере.

     - pipesyms ::
       Вернуть список имён функций соответствующих адресам на конвейере,
       используя активную таблицу символов.

*** Вмешательство
     - set name-or-address value ::
       Установить регистр или ячейку памяти заданный/-ую через спецификатор адреса
       NAME-OR-ADDRESS.  Также доступен синтаксис (setf (get NAME-OR-ADDRESS) VALUE).

*** Трассировка
     - trace count &rest run-params ::
       Исполнить COUNT инструкций и остановиться.
       
       Остаточные параметры передаются команде RUN.

     - block-trace size &optional count &rest run-args &key (state :stop) &allow-other-keys ::
       Произвести трассировку блоками, по SIZE инструкций в блоке.
       Если задан параметр COUNT не равный NIL, выйти после указанного им количества блоков.
       
       Остаточные параметры при каждом пуске передаются команде RUN.

     - count-trace addr-or-sym &rest run-args ::
       Установить аппаратную точку останова в адрес заданный через 
       спецификатор адреса ADDR-OR-SYM, и запускать целевое устройство, 
       выводя на экран счётчик остановов.
       
       Остаточные параметры при каждом пуске передаются команде RUN.

     - insn-trace size &key check (addr 0) (mask 7fffffff) (mode :trace) (print-syms t) full-pipeline ::
       Произвести пошаговую трассировку, длиной SIZE шагов, снимая значения регистров
       конвейера на каждом шагу.
       
       Принимаются следующие ключевые аргументы:
         - CHECK ::
           на каждом шагу проверять соответствие фактически декодируемого значения инструкции
           содержимому памяти по адресу указываемому соответствующим регистром конвейера (PCdec),
       
         - ADDR, MASK ::
           при осуществлении вышеуказанной проверки, осуществлять отображение регистра PCdec,
           путём замены битов не указанных в MASK соответствующими битами из ADDR,
       
         - MODE ::
           выбор механизма осуществления шага -- :STEP или :TRACE,
       
         - PRINT-SYMS ::
           разрешать значения адресов в регистре PCdec в символьные имена, используя активную таблицу символов,
       
         - FULL-PIPELINE ::
           снимать все регистры конвейера, а не только PCdec и IRdec.

     - staircase-trace callspecs &rest run-args ::
       Произвести т.н. "лестничную трассировку", состоящую из ступеней, задаваемых
       параметром CALLSPECS, каждая из которых содержит спецификатор адреса точки останова
       и количество пропусков данной точки для перехода к следующей ступени.
       
       Остаточные параметры при каждом пуске передаются команде RUN.

*** Прочее
     - sleep seconds ::
       Эта функция приостанавливает исполнение на SECONDS.  
       SECONDS могут быть любым неотрицательным реальным числом.

     - write-completions filename &optional (packages =*tui-completable-packages*=) qualified-packages ::
       Записать информацию для автодополнений символов из списка пакетов PACKAGES,
       в формате GNU Readline в FILENAME.  Имена символов из пакетов в списке
       QUALIFIED-PACKAGES дополняются префиксом из короткого имени пакета и
       символа двоеточия.

     - list-platforms ::
       Вывести список всех известных платформ.

     - version ::
       Вывести версию отладчика.
       Команда различает релизные версии и версии в разработке.

*** Грубое управление
     - load pathspec &key (verbose =*load-verbose*=) (print =*load-print*=) (if-does-not-exist t) (external-format :default) ::
       Загрузить файл указанный с помощью PATHSPEC, последовательно считывая
       и исполняя содержащиеся в нём формы.

     - quit &optional (status 0) ::
       Выйти из отладчика, не меняя состояние целевого устройства.

