doc/comdb-notes-ru.html

<div id="outline-container-6.11" class="outline-3">
<h3 id="sec-6.11"><span class="section-number-3">6.11</span> Анализ </h3>
<div class="outline-text-3" id="text-6.11">

<dl>
<dt>disasm &amp;optional address-or-symbol length line-pre-annotate-fn annotations</dt><dd>

<p>
Дизассемблировать содержимое диапазона ячеек памяти начиная с
ADDRESS-OR-SYMBOL и длиной LENGTH.
</p>
<p>
Значение параметра ADDRESS-OR-SYMBOL по умолчанию равно содержимому
регистра адреса выборки конвейера уменьшенному на #x10.
</p>
<p>
Значение параметра LENGTH по умолчанию равно либо #x20, если ADDRESS-OR-SYMBOL представляет собой целое,
либо разнице между адресами символов ADDRESS-OR-SYMBOL и следующего за ним.
</p>
</dd>
<dt>displash address &amp;optional (splash-size 10) annotations</dt><dd>

<p>
Дизассемблирование адресов в коридоре вокруг ADDRESS.
Величина коридора задаётся параметром SPLASH-SIZE.
</p>
</dd>
<dt>dispack &amp;optional (name :pipeline)</dt><dd>

<p>
Напечатать значения регистров из заготовленной пачки с именем NAME.
</p>
</dd>
<dt>dump address-or-symbol &amp;optional (length 100)</dt><dd>

<p>
Напечатать содержимое диапазона ячеек памяти начиная с ADDRESS-OR-SYMBOL
и длиной LENGTH.
</p>
</dd>
<dt>print-memory address length</dt><dd>

<p>
Напечатать содержимое диапазона ячеек памяти начиная с ADDRESS и
длиной LENGTH, как текст.
</p>
</dd>
<dt>print-tlb &amp;optional (page-size 4000)</dt><dd>

<p>
Распечатать содержимое TLB.  Размер отображаемый страницей принимается
равным PAGE-SIZE.
</p>
</dd>
<dt>display &amp;rest new-items</dt><dd>

<p>
Печатать значения регистров чьи имена находятся в <i>месте</i>
(DISPLAY-LIST).  Когда команде передаются параметры, они замещают
старое значение (DISPLAY-LIST).
</p>
</dd>
<dt>edisplay</dt><dd>

<p>
Как DISPLAY, с добавлением типично востребованной информации:
cop0.count, cop0.epc, cop0.badvaddr, cop0.cause и дизассемблированием
адресов вокруг pcfetch и cop0.epc.
</p>
</dd>
<dt>display-list</dt><dd>

<p>
<i>Место</i> предоставляющее доступ к текущему списку отображения.
</p>
</dd>
<dt>explain &amp;optional (core <code>*core*</code>)</dt><dd>

<p>
Отобразить причину останова ядра CORE.
По умолчанию используется ядро текущего активного устройства.
</p>
</dd>
<dt>get name-or-address</dt><dd>

<p>
Получить регистр или ячейку памяти заданный/-ую через <a href="#спецификатор==адреса">спецификатор адреса</a>
NAME-OR-ADDRESS, представляющем собой либо <a href="#ключевое==слово">ключевое слово</a>.
</p>
</dd>
<dt>set name-or-address value</dt><dd>

<p>
Установить регистр или ячейку памяти заданный/-ую через <a href="#спецификатор==адреса">спецификатор адреса</a>
NAME-OR-ADDRESS.  Также доступен синтаксис (setf (get NAME-OR-ADDRESS) VALUE).
</p>
</dd>
<dt>peek address-or-symbol &amp;optional verbose</dt><dd>

<p>
Напечатать содержимое ячейки по адресу ADDRESS-OR-SYMBOL, опционально,
при указанном не-NIL значении параметра VERBOSE, расшифровывая значение
ADDRESS-OR-SYMBOL в контексте активной таблицы символов.
</p>
</dd>
<dt>show name-or-address</dt><dd>

<p>
Получить регистр или ячейку памяти заданный/-ую через <a href="#спецификатор==адреса">спецификатор адреса</a>
NAME-OR-ADDRESS.  В том случае если указано имя регистра имеющего структуру,
полученное значение разобирается по полям, и возвращается как второе значение
функции.
</p>
</dd>
<dt>pipeline</dt><dd>

<p>
Как DISPLAY, но анализирует лишь адреса на конвейере.
</p>
</dd>
<dt>pipesyms</dt><dd>

<p>
Вернуть список имён функций соответствующих адресам на конвейере,
используя активную таблицу символов.
</p>
</dd>
</dl>
</div>

</div>

<div id="outline-container-6.12" class="outline-3">
<h3 id="sec-6.12"><span class="section-number-3">6.12</span> Вмешательство </h3>
<div class="outline-text-3" id="text-6.12">

<dl>
<dt>set name-or-address value</dt><dd>

<p>
Установить регистр или ячейку памяти заданный/-ую через <a href="#спецификатор==адреса">спецификатор адреса</a>
NAME-OR-ADDRESS.  Также доступен синтаксис (setf (get NAME-OR-ADDRESS) VALUE).
</p>
</dd>
</dl>
</div>

</div>

<div id="outline-container-6.13" class="outline-3">
<h3 id="sec-6.13"><span class="section-number-3">6.13</span> Трассировка </h3>
<div class="outline-text-3" id="text-6.13">

<dl>
<dt>trace count &amp;rest run-params</dt><dd>

<p>
Исполнить COUNT инструкций и остановиться.
</p>
<p>
Остаточные параметры передаются команде RUN.
</p>
</dd>
<dt>block-trace size &amp;optional count &amp;rest run-args &amp;key (state :stop) &amp;allow-other-keys</dt><dd>

<p>
Произвести трассировку блоками, по SIZE инструкций в блоке.
Если задан <a href="#параметр">параметр</a> COUNT не равный NIL, выйти после указанного им количества блоков.
</p>
<p>
Остаточные параметры при каждом пуске передаются команде RUN.
</p>
</dd>
<dt>count-trace addr-or-sym &amp;rest run-args</dt><dd>

<p>
Установить аппаратную точку останова в адрес заданный через 
<a href="#спецификатор==адреса">спецификатор адреса</a> ADDR-OR-SYM, и запускать <a href="#целевое==устройство">целевое устройство</a>, 
выводя на экран счётчик остановов.
</p>
<p>
Остаточные параметры при каждом пуске передаются команде RUN.
</p>
</dd>
<dt>insn-trace size &amp;key check (addr 0) (mask 7fffffff) (mode :trace) (print-syms t) full-pipeline</dt><dd>

<p>
Произвести пошаговую трассировку, длиной SIZE шагов, снимая значения регистров
конвейера на каждом шагу.
</p>
<p>
Принимаются следующие ключевые аргументы:
</p><dl>
<dt>CHECK</dt><dd>

<p>
на каждом шагу проверять соответствие фактически декодируемого значения инструкции
содержимому памяти по адресу указываемому соответствующим регистром конвейера (PCdec),
</p>
</dd>
<dt>ADDR, MASK</dt><dd>

<p>
при осуществлении вышеуказанной проверки, осуществлять отображение регистра PCdec,
путём замены битов не указанных в MASK соответствующими битами из ADDR,
</p>
</dd>
<dt>MODE</dt><dd>

<p>
выбор механизма осуществления шага &ndash; :STEP или :TRACE,
</p>
</dd>
<dt>PRINT-SYMS</dt><dd>

<p>
разрешать значения адресов в регистре PCdec в символьные имена, используя активную таблицу символов,
</p>
</dd>
<dt>FULL-PIPELINE</dt><dd>

<p>
снимать все регистры конвейера, а не только PCdec и IRdec.
</p>
</dd>
</dl>
</dd>
<dt>staircase-trace callspecs &amp;rest run-args</dt><dd>

<p>
Произвести т.н. "лестничную трассировку", состоящую из ступеней, задаваемых
параметром CALLSPECS, каждая из которых содержит <a href="#спецификатор==адреса">спецификатор адреса</a> точки останова
и количество пропусков данной точки для перехода к следующей ступени.
</p>
<p>
Остаточные параметры при каждом пуске передаются команде RUN.
</p>
</dd>
</dl>
</div>

</div>

<div id="outline-container-6.14" class="outline-3">
<h3 id="sec-6.14"><span class="section-number-3">6.14</span> Прочее </h3>
<div class="outline-text-3" id="text-6.14">

<dl>
<dt>sleep seconds</dt><dd>

<p>
Эта функция приостанавливает исполнение на SECONDS.  
SECONDS могут быть любым неотрицательным реальным числом.
</p>
</dd>
<dt>write-completions filename &amp;optional (packages <code>*tui-completable-packages*</code>) qualified-packages</dt><dd>

<p>
Записать информацию для автодополнений символов из списка пакетов PACKAGES,
в формате GNU Readline в FILENAME.  Имена символов из пакетов в списке
QUALIFIED-PACKAGES дополняются префиксом из короткого имени пакета и
символа двоеточия.
</p>
</dd>
<dt>list-platforms</dt><dd>

<p>
Вывести список всех известных платформ.
</p>
</dd>
<dt>version</dt><dd>

<p>
Вывести версию отладчика.
Команда различает релизные версии и версии в разработке.
</p>
</dd>
</dl>
</div>

</div>

<div id="outline-container-6.15" class="outline-3">
<h3 id="sec-6.15"><span class="section-number-3">6.15</span> Грубое управление </h3>
<div class="outline-text-3" id="text-6.15">

<dl>
<dt>load pathspec &amp;key (verbose <code>*load-verbose*</code>) (print <code>*load-print*</code>) (if-does-not-exist t) (external-format :default)</dt><dd>

<p>
Загрузить файл указанный с помощью PATHSPEC, последовательно считывая
и исполняя содержащиеся в нём формы.
</p>
</dd>
<dt>quit &amp;optional (status 0)</dt><dd>

<p>
Выйти из отладчика, не меняя состояние целевого устройства.
</p>
</dd>
</dl>
</div>

</div>
