doc/comdb-notes-ru.org
*** Тестирование
     - run-tests &optional all-contexts &rest test-suites ::
       Выполнить серию тестов из тестовых наборов, с названиями в остаточном списке
       параметров, на всех доступных устройствах.  По умолчанию используются тестовые наборы
       :INTERFACE и :TARGET.

     - testir ::
       Бесконечный цикл записи команды DEBUG REQUEST в регистр TAP IR,
       с печатью возвращаемого значения.

     - testmem &optional (address 0) (length 10000) ::
       Протестировать диапазон ячеек памяти длиной в LENGTH байт,
       начиная с ADDRESS.

*** Команды отладчика MDB получившие новое название
      - source [[file:~/source/mdb/src/cmd.c::void%20mdb_source%20int%20argc%20char%20argv][.]] => load :: 
      - load [[file:~/source/mdb/src/cmd.c::void%20mdb_load%20int%20argc%20char%20argv][.]] => loadeltext :: 
      - save [[file:~/source/mdb/src/cmd.c::void%20mdb_save%20int%20argc%20char%20argv][.]] => saveeltext :: 
      - dump-raw [[file:~/source/mdb/src/cmd.c::void%20mdb_dump_raw%20int%20argc%20char%20argv][.]] => dump ::
      - leave [[file:~/source/mdb/src/cmd.c::void%20mdb_leave%20int%20argc%20char%20argv][.]] => leave-frame ::
      - tlb [[file:~/source/mdb/src/cmd.c::void%20mdb_leave%20int%20argc%20char%20argv][.]] => print-tlb ::

      - version [[file:~/source/mdb/src/cmd.c::void%20mdb_version%20int%20argc%20char%20argv][.]] ::
      - conf [[file:~/source/mdb/src/cmd.c::void%20mdb_conf%20int%20argc%20char%20argv][.]] ::

      - epp [[file:~/source/mdb/src/cmd.c::void%20mdb_epp%20int%20argc%20char%20argv][.]] => set-epp :: 
      - jtag [[file:~/source/mdb/src/cmd.c::void%20mdb_jtag%20int%20argc%20char%20argv][.]] => set-jtag :: 

      - sbp [[file:~/source/mdb/src/cmd.c::void%20mdb_sbp%20int%20argc%20char%20argv][.]] => sw-break ::
      - bp [[file:~/source/mdb/src/cmd.c::void%20mdb_watchpoint%20int%20argc%20char%20argv][.]] => hw-break ::
      - wp [[file:~/source/mdb/src/cmd.c::void%20mdb_watchpoint%20int%20argc%20char%20argv][.]] => watch ::

      - drun [[file:~/source/mdb/src/cmd.c::void%20mdb_drun%20int%20argc%20char%20argv][.]] => dsprun :: 
      - dstep [[file:~/source/mdb/src/cmd.c::void%20mdb_dstep%20int%20argc%20char%20argv][.]] => dspstep :: 
      - dbp [[file:~/source/mdb/src/cmd.c::void%20mdb_dbp%20int%20argc%20char%20argv][.]] => dspbreak ::
      - dspbp [[file:~/source/mdb/src/cmd.c::void%20mdb_dspbp%20int%20argc%20char%20argv][.]] => dspbreak (sort of) ::

      - expert [[file:~/source/mdb/src/cmd.c::void%20mdb_expert%20int%20argc%20char%20argv][.]] ::
      - eset [[file:~/source/mdb/src/cmd.c::void%20mdb_eset%20int%20argc%20char%20argv][.]] :: 
      - eshow [[file:~/source/mdb/src/cmd.c::void%20mdb_eshow%20int%20argc%20char%20argv][.]] :: 
      - estep [[file:~/source/mdb/src/cmd.c::void%20mdb_estep%20int%20argc%20char%20argv][.]] :: 
      - erun [[file:~/source/mdb/src/cmd.c::void%20mdb_erun%20int%20argc%20char%20argv][.]] :: 
      - eruntrace [[file:~/source/mdb/src/cmd.c::void%20mdb_eruntrace%20int%20argc%20char%20argv][.]] ::
      - etrace [[file:~/source/mdb/src/cmd.c::void%20mdb_etrace%20int%20argc%20char%20argv][.]] :: 

      - halt [[file:~/source/mdb/src/cmd.c::void%20mdb_halt%20int%20argc%20char%20argv][.]] :: 
      - runonly [[file:~/source/mdb/src/cmd.c::void%20mdb_runonly%20int%20argc%20char%20argv][.]] ::
      - runloop [[file:~/source/mdb/src/cmd.c::void%20mdb_runloop%20int%20argc%20char%20argv][.]] ::
      - wait [[file:~/source/mdb/src/cmd.c::void%20mdb_wait%20int%20argc%20char%20argv][.]] :: 
      - exit [[file:~/source/mdb/src/cmd.c::void%20mdb_quit%20int%20argc%20char%20argv][.]] :: 

      - testoncd [[file:~/source/mdb/src/cmd.c::void%20mdb_testoncd%20int%20argc%20char%20argv][.]] :: 

* Описание ключевых операций
*** Инициализация
    Инициализация бывает двух сортов:
    - первичная, включающая процессы поиска и анализа подключенных целевых устройств;
      инициализирует все найденные новоподключенные устройства.
    - повторная, без поиска устройств;
      инициализирует текущее активное устройство.

***** Первичная инициализация
      - scan &optional force-rescan => <нет значений> ::
        
        Функция производит следующие операции:
        - поиск адаптеров подключенных к EPP и USB,
        - для каждого подключенного адаптера:
          - анализ OnCD подключенного к адаптеру целевого устройства,
          - определение типа платформы целевого устройства,
          - инициализацию компонентов платформы целевого устройства.

        Если функции первым параметром передан не-NIL, то производится повторный
        анализ уже найденных к данному моменту адаптеров с подключенными к ним
        целевыми устройствами.

        При нескольких подключенных устройствах, активным становится последнее найденное.
        При этом, следует отметить что шина USB сканируется после портов EPP, что, как следствие,
        придаёт адаптерам на шине USB некоторый "приоритет".

******* Поиск адаптеров
********* EPP
          Производится запрос на получение привилегий доступа к портам EPP.  На UNIX-системах это осуществляется
          путём вызова системной функции iopl().  В Windows используется внешний, поставляемый с отладчиком сервис
          mcdbio.sys.

          - bus-probe-address (o parport-bus) address => <булево значение> ::
            Младшие три бита статусного регистра портов с адресами #x378, #x279, #xbc0 и #xb80 проверяются
            на значения 1 и 2, интерпретируемые в качестве версии адаптера.

********* USB
          - В UNIX: bus-occupied-addresses (o ezusb-bus) => <список адресов> ::
          - В Windows: bus-probe-address (o ezusb-bus) address => <булево значение> ::

            Производится серия запросов к ОС, осуществляющих поиск устрйств с USB ID #x0547:#x1002.  На UNIX-системах это
            осуществляется напрямую через системные интерфейсы sysfs и usbfs.  В Windows используется специальный драйвер
            ezusb.sys.
      
******* Анализ OnCD подключенного целевого устройства
        - bus-populate-address (o ezusb-bus) address => <интерфейс> ::
        - bus-populate-address (o parport-bus) address => <интерфейс> ::

          Производится сброс адаптера, затем TAP. Одновременно с этим выполняется команда TAP IDCODE.

        - find-target-class-for-interface interface &optional (if-does-not-exist :error) => <тип OnCD> ::

          Возвращённое командой TAP IDCODE значение интерпретируется как идентификатор целевого устройства.
          Текущий набор распознаваемых идентификаторов -- 2 и 3, соответствующие механизмам OnCD до NVCom,
          и начиная с него.

******* Определение типа платформы целевого устройства
        - detect-target-platform target &optional (if-does-not-exist :error) => <платформа> ::

          Функция производит считывание ячейки памяти по физическому адресу #x18480108,
          что соответствует адресу идентификационного регистра первого DSP (когда он присутствует
          на целевом устройстве), интерпретирует полученное значение как версию DSP и использует её
          для выбора платформы.

          Этот механизм имеет слабые стороны:
            - не все платформы имеют DSP, и как следствие идентификационный регистр,
            - некоторые платформы имеют DSP с одинаковыми идентификационными регистрами.

