doc/comdb-notes-ru.html

<div id="outline-container-6.16" class="outline-3">
<h3 id="sec-6.16"><span class="section-number-3">6.16</span> Тестирование </h3>
<div class="outline-text-3" id="text-6.16">

<dl>
<dt>run-tests &amp;optional all-contexts &amp;rest test-suites</dt><dd>

<p>
Выполнить серию тестов из тестовых наборов, с названиями в остаточном списке
параметров, на всех доступных устройствах.  По умолчанию используются тестовые наборы
:INTERFACE и :TARGET.
</p>
</dd>
<dt>testir</dt><dd>

<p>
Бесконечный цикл записи команды DEBUG REQUEST в регистр TAP IR,
с печатью возвращаемого значения.
</p>
</dd>
<dt>testmem &amp;optional (address 0) (length 10000)</dt><dd>

<p>
Протестировать диапазон ячеек памяти длиной в LENGTH байт,
начиная с ADDRESS.
</p>

</dd>
</dl>
</div>

</div>

<div id="outline-container-6.17" class="outline-3">
<h3 id="sec-6.17"><span class="section-number-3">6.17</span> Команды отладчика MDB получившие новое название </h3>
<div class="outline-text-3" id="text-6.17">

<dl>
<dt>source <a href="/home/deepfire/source/mdb/src/cmd.c">.</a> =&gt; load</dt><dd>

</dd>
<dt>load <a href="/home/deepfire/source/mdb/src/cmd.c">.</a> =&gt; loadeltext</dt><dd>

</dd>
<dt>save <a href="/home/deepfire/source/mdb/src/cmd.c">.</a> =&gt; saveeltext</dt><dd>

</dd>
<dt>dump-raw <a href="/home/deepfire/source/mdb/src/cmd.c">.</a> =&gt; dump</dt><dd>

</dd>
<dt>leave <a href="/home/deepfire/source/mdb/src/cmd.c">.</a> =&gt; leave-frame</dt><dd>

</dd>
<dt>tlb <a href="/home/deepfire/source/mdb/src/cmd.c">.</a> =&gt; print-tlb</dt><dd>


</dd>
<dt>version <a href="/home/deepfire/source/mdb/src/cmd.c">.</a></dt><dd>

</dd>
<dt>conf <a href="/home/deepfire/source/mdb/src/cmd.c">.</a></dt><dd>


</dd>
<dt>epp <a href="/home/deepfire/source/mdb/src/cmd.c">.</a> =&gt; set-epp</dt><dd>

</dd>
<dt>jtag <a href="/home/deepfire/source/mdb/src/cmd.c">.</a> =&gt; set-jtag</dt><dd>


</dd>
<dt>sbp <a href="/home/deepfire/source/mdb/src/cmd.c">.</a> =&gt; sw-break</dt><dd>

</dd>
<dt>bp <a href="/home/deepfire/source/mdb/src/cmd.c">.</a> =&gt; hw-break</dt><dd>

</dd>
<dt>wp <a href="/home/deepfire/source/mdb/src/cmd.c">.</a> =&gt; watch</dt><dd>


</dd>
<dt>drun <a href="/home/deepfire/source/mdb/src/cmd.c">.</a> =&gt; dsprun</dt><dd>

</dd>
<dt>dstep <a href="/home/deepfire/source/mdb/src/cmd.c">.</a> =&gt; dspstep</dt><dd>

</dd>
<dt>dbp <a href="/home/deepfire/source/mdb/src/cmd.c">.</a> =&gt; dspbreak</dt><dd>

</dd>
<dt>dspbp <a href="/home/deepfire/source/mdb/src/cmd.c">.</a> =&gt; dspbreak (sort of)</dt><dd>


</dd>
<dt>expert <a href="/home/deepfire/source/mdb/src/cmd.c">.</a></dt><dd>

</dd>
<dt>eset <a href="/home/deepfire/source/mdb/src/cmd.c">.</a></dt><dd>

</dd>
<dt>eshow <a href="/home/deepfire/source/mdb/src/cmd.c">.</a></dt><dd>

</dd>
<dt>estep <a href="/home/deepfire/source/mdb/src/cmd.c">.</a></dt><dd>

</dd>
<dt>erun <a href="/home/deepfire/source/mdb/src/cmd.c">.</a></dt><dd>

</dd>
<dt>eruntrace <a href="/home/deepfire/source/mdb/src/cmd.c">.</a></dt><dd>

</dd>
<dt>etrace <a href="/home/deepfire/source/mdb/src/cmd.c">.</a></dt><dd>


</dd>
<dt>halt <a href="/home/deepfire/source/mdb/src/cmd.c">.</a></dt><dd>

</dd>
<dt>runonly <a href="/home/deepfire/source/mdb/src/cmd.c">.</a></dt><dd>

</dd>
<dt>runloop <a href="/home/deepfire/source/mdb/src/cmd.c">.</a></dt><dd>

</dd>
<dt>wait <a href="/home/deepfire/source/mdb/src/cmd.c">.</a></dt><dd>

</dd>
<dt>exit <a href="/home/deepfire/source/mdb/src/cmd.c">.</a></dt><dd>


</dd>
<dt>testoncd <a href="/home/deepfire/source/mdb/src/cmd.c">.</a></dt><dd>


</dd>
</dl>
</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Описание ключевых операций </h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7.1" class="outline-3">
<h3 id="sec-7.1"><span class="section-number-3">7.1</span> Инициализация </h3>
<div class="outline-text-3" id="text-7.1">

<p>Инициализация бывает двух сортов:
</p><ul>
<li>
первичная, включающая процессы поиска и анализа подключенных целевых устройств;
инициализирует все найденные новоподключенные устройства.
</li>
<li>
повторная, без поиска устройств;
инициализирует текущее активное устройство.

</li>
</ul>

</div>

<div id="outline-container-7.1.1" class="outline-4">
<h4 id="sec-7.1.1"><span class="section-number-4">7.1.1</span> Первичная инициализация </h4>
<div class="outline-text-4" id="text-7.1.1">

<dl>
<dt>scan &amp;optional force-rescan =&gt; &lt;нет значений&gt;</dt><dd>


<p>
Функция производит следующие операции:
</p><ul>
<li>
поиск адаптеров подключенных к EPP и USB,
</li>
<li>
для каждого подключенного адаптера:
<ul>
<li>
анализ OnCD подключенного к адаптеру целевого устройства,
</li>
<li>
определение типа платформы целевого устройства,
</li>
<li>
инициализацию компонентов платформы целевого устройства.

</li>
</ul>
</li>
</ul>

<p>Если функции первым параметром передан не-NIL, то производится повторный
анализ уже найденных к данному моменту адаптеров с подключенными к ним
целевыми устройствами.
</p>
<p>
При нескольких подключенных устройствах, активным становится последнее найденное.
При этом, следует отметить что шина USB сканируется после портов EPP, что, как следствие,
придаёт адаптерам на шине USB некоторый "приоритет".
</p>
</dd>
</dl>

</div>

<div id="outline-container-7.1.1.1" class="outline-5">
<h5 id="sec-7.1.1.1"><span class="section-number-5">7.1.1.1</span> Поиск адаптеров </h5>
<div class="outline-text-5" id="text-7.1.1.1">

<ul>
<li id="sec-7.1.1.1.1">EPP <br/>
Производится запрос на получение привилегий доступа к портам EPP.  На UNIX-системах это осуществляется
путём вызова системной функции iopl().  В Windows используется внешний, поставляемый с отладчиком сервис
mcdbio.sys.

<dl>
<dt>bus-probe-address (o parport-bus) address =&gt; &lt;булево значение&gt;</dt><dd>

<p>
Младшие три бита статусного регистра портов с адресами #x378, #x279, #xbc0 и #xb80 проверяются
на значения 1 и 2, интерпретируемые в качестве версии адаптера.
</p>
</dd>
</dl>
</li>
<li id="sec-7.1.1.1.2">USB <br/>
<dl>
<dt>В UNIX: bus-occupied-addresses (o ezusb-bus) =&gt; &lt;список адресов&gt;</dt><dd>

</dd>
<dt>В Windows: bus-probe-address (o ezusb-bus) address =&gt; &lt;булево значение&gt;</dt><dd>


<p>
Производится серия запросов к ОС, осуществляющих поиск устрйств с USB ID #x0547:#x1002.  На UNIX-системах это
осуществляется напрямую через системные интерфейсы sysfs и usbfs.  В Windows используется специальный драйвер
ezusb.sys.
</p>
</dd>
</dl>
</li>
</ul>
</div>

</div>

<div id="outline-container-7.1.1.2" class="outline-5">
<h5 id="sec-7.1.1.2"><span class="section-number-5">7.1.1.2</span> Анализ OnCD подключенного целевого устройства </h5>
<div class="outline-text-5" id="text-7.1.1.2">

<dl>
<dt>bus-populate-address (o ezusb-bus) address =&gt; &lt;интерфейс&gt;</dt><dd>

</dd>
<dt>bus-populate-address (o parport-bus) address =&gt; &lt;интерфейс&gt;</dt><dd>


<p>
Производится сброс адаптера, затем TAP. Одновременно с этим выполняется команда TAP IDCODE.
</p>
</dd>
<dt>find-target-class-for-interface interface &amp;optional (if-does-not-exist :error) =&gt; &lt;тип OnCD&gt;</dt><dd>


<p>
Возвращённое командой TAP IDCODE значение интерпретируется как идентификатор целевого устройства.
Текущий набор распознаваемых идентификаторов &ndash; 2 и 3, соответствующие механизмам OnCD до NVCom,
и начиная с него.
</p>
</dd>
</dl>
</div>

</div>

<div id="outline-container-7.1.1.3" class="outline-5">
<h5 id="sec-7.1.1.3"><span class="section-number-5">7.1.1.3</span> Определение типа платформы целевого устройства </h5>
<div class="outline-text-5" id="text-7.1.1.3">

<dl>
<dt>detect-target-platform target &amp;optional (if-does-not-exist :error) =&gt; &lt;платформа&gt;</dt><dd>


<p>
Функция производит считывание ячейки памяти по физическому адресу #x18480108,
что соответствует адресу идентификационного регистра первого DSP (когда он присутствует
на целевом устройстве), интерпретирует полученное значение как версию DSP и использует её
для выбора платформы.
</p>
<p>
Этот механизм имеет слабые стороны:
</p><ul>
<li>
не все платформы имеют DSP, и как следствие идентификационный регистр,
</li>
<li>
некоторые платформы имеют DSP с одинаковыми идентификационными регистрами.

</li>
</ul>
</dd>
</dl>
</div>

</div>
