doc/comdb-notes-ru.org
******* Инициализацию компонентов платформы целевого устройства
        В рамках этого этапа производятся следующие три шага:

********* Определение набора компонентов целевого устройства
          - populate-target (o target) => <нет значений> ::

            Определение набора компонентов целевого устройства, исходя из предопределённого списка
            компонентов соответствующей платформы.

            Именно в данный момент определяются типы RISC- и DSP- ядер, механизмов системного
            управления и диапазоны платформенной памяти (за исключением CRAM).

********* Первичная инициализация платформенных устройств
          - init-target-platform (o target) (p multicore-platform) => <нет значений> ::
          
            Первичная инициализация платформенных устройств, в рамках которой производится определение
            фактического размера памяти CRAM.  Для получения этого значения не используется
            предопределённый список платформенных устройств, т.к. последний составляется людьми,
            и, как следствие, может содержать ошибки -- при том что точный размер CRAM является важным
            для функционирования некоторых компонентов отладчика.

********* Настройка системных компонентов платформы целевого устройства
          - configure-target-platform (o target) (p platform) &key prereset-core-multiplier core-multiplier inhibit-memory-detection force-memory-detection (error-on-failed-detection t) => <булево значение> :: 

            Эта функция, в свою очередь, опирается на нижеследующие, причём
            определение и настройка основной памяти является опциональной.

*********** Настройка делителей частоты и системы управления питанием
            - configure-platform-system (p platform) (s system) &key core-multiplier => <нет значений> ::

              Производится настройка делителей частоты кристалла и системы управления питанием.

*********** Определение и настройка основной памяти
            - configure-target-memory target &optional force-detection (error-on-failed-detection t) => <нет значений> ::

              Среди набора известных значений настройки ChipSelect-ов и контроллера SDRAM производится поиск
              работающих для данной платы целевого устройства, в том случае если таковой не был найден ранее.

              При указанном ключе FORCE-DETECTION подбор производится несмотря на наличие уже найденного набора.

***** Повторная инициализация
      - reset &rest platform-args &key (core =*core*=) (state =*depth*=) &allow-other-keys => <нет значений> ::

        Функция сбрасывает и перенастраивает целевое устройство содержащее ядро CORE (по умолчанию выбирается являющееся активным в данный момент), 
        с учётом ключевых аргументов PLATFORM-ARGS.
        Производятся следующие действия:
        - осуществляется попытка выяснить текущие значения делителей частоты;
        - кристалл сбрасывается в первоначальное состояние;
        - системные компоненты перенастраиваются с использованием либо сохранённых значений делителей частоты,
          либо значений по умолчанию для данной платформы.
        - устанавливается соответствующая текущим настройкам глубина режима отладки (по умолчанию -- :DEBUG).

******* Определение текущего значения делителя частоты кристалла.
        - platform-core-frequency-multiplier platform system core => <целое число> ::

******* Сброс кристалла в первоначальное состояние
        - reset-target-platform (o target) (p platform) &rest platform-args &key stop-cores-p &allow-other-keys => <нет значений> ::

          Данная функция опирается на нижеследующие:

********* Сброс целевого устройства стредствами TAP
          - interface-reset-target (o parport-interface) stop-cores-p ::
          - interface-reset-target (o ezusb-interface) stop-cores-p ::

            Средствами адаптера осуществляется аппаратный сброс целевого устройства, после чего выполняются
            команды TAP DEBUG REQUEST и DEBUG ENABLE.

********* Инициализация состояния RISC-ядер
          - reset-core (core mips-core) ::

            Эта функция убирает все активные точки останова и сбрасывает все ведомые ядра (т.е. DSP).

********* Настройка системных компонентов платформы целевого устройства
          Эта функция была описана выше, см. [[configure%20target%20platform%20o%20target%20p%20platform][Настройка системных компонентов платформы целевого устройства]].

******* Установка глубины режима отладки
        - (setf state) new-state core &rest transition-args ::

          Управление состоянием отладки ядра CORE.

          Параметр NEW-STATE может принимать одно из следующих состояний:
            - :DEBUG, для глубокого, инвазивного режима отладки, с полностью доступным функционалом отладчика;
            - :STOP, для режима минимального вмешательства;
            - :FREE, запуск ядра.

* Существенные недостатки
  - отсутствие поддержки отладки DSP-ядер семейства кристаллов до NVCom;
  - отсутствие механизма автодополнения команд в интерактивном режиме в Windows,
    и сколько-либо приемлимого механизма редактирования строки в Linux вообще[fn:6];
  - лишь частичная поддержка системы команд mdb;
  - отсутствие поддержки сценариев в формате mdb;
  - отсутствие механизма асинхронного запроса прерывания исполнения и выхода из режима отладки
    на платформе Windows.
