doc/comdb-notes-ru.html

<div id="outline-container-7.1.1.4" class="outline-5">
<h5 id="sec-7.1.1.4"><span class="section-number-5">7.1.1.4</span> Инициализацию компонентов платформы целевого устройства </h5>
<div class="outline-text-5" id="text-7.1.1.4">

<p>В рамках этого этапа производятся следующие три шага:
</p>
<ul>
<li id="sec-7.1.1.4.1">Определение набора компонентов целевого устройства <br/>
<dl>
<dt>populate-target (o target) =&gt; &lt;нет значений&gt;</dt><dd>


<p>
Определение набора компонентов целевого устройства, исходя из предопределённого списка
компонентов соответствующей платформы.
</p>
<p>
Именно в данный момент определяются типы RISC- и DSP- ядер, механизмов системного
управления и диапазоны платформенной памяти (за исключением CRAM).
</p>
</dd>
</dl>
</li>
<li id="sec-7.1.1.4.2">Первичная инициализация платформенных устройств <br/>
<dl>
<dt>init-target-platform (o target) (p multicore-platform) =&gt; &lt;нет значений&gt;</dt><dd>


<p>
Первичная инициализация платформенных устройств, в рамках которой производится определение
фактического размера памяти CRAM.  Для получения этого значения не используется
предопределённый список платформенных устройств, т.к. последний составляется людьми,
и, как следствие, может содержать ошибки &ndash; при том что точный размер CRAM является важным
для функционирования некоторых компонентов отладчика.
</p>
</dd>
</dl>
</li>
<li id="sec-7.1.1.4.3">Настройка системных компонентов платформы целевого устройства <br/>
<dl>
<dt>configure-target-platform (o target) (p platform) &amp;key prereset-core-multiplier core-multiplier inhibit-memory-detection force-memory-detection (error-on-failed-detection t) =&gt; &lt;булево значение&gt;</dt><dd>


<p>
Эта функция, в свою очередь, опирается на нижеследующие, причём
определение и настройка основной памяти является опциональной.
</p>
</dd>
</dl>
<ul>
<li id="sec-7.1.1.4.3.1">Настройка делителей частоты и системы управления питанием <br/>
<dl>
<dt>configure-platform-system (p platform) (s system) &amp;key core-multiplier =&gt; &lt;нет значений&gt;</dt><dd>


<p>
Производится настройка делителей частоты кристалла и системы управления питанием.
</p>
</dd>
</dl>
</li>
<li id="sec-7.1.1.4.3.2">Определение и настройка основной памяти <br/>
<dl>
<dt>configure-target-memory target &amp;optional force-detection (error-on-failed-detection t) =&gt; &lt;нет значений&gt;</dt><dd>


<p>
Среди набора известных значений настройки ChipSelect-ов и контроллера SDRAM производится поиск
работающих для данной платы целевого устройства, в том случае если таковой не был найден ранее.
</p>
<p>
При указанном ключе FORCE-DETECTION подбор производится несмотря на наличие уже найденного набора.
</p>
</dd>
</dl>
</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-7.1.2" class="outline-4">
<h4 id="sec-7.1.2"><span class="section-number-4">7.1.2</span> Повторная инициализация </h4>
<div class="outline-text-4" id="text-7.1.2">

<dl>
<dt>reset &amp;rest platform-args &amp;key (core <code>*core*</code>) (state <code>*depth*</code>) &amp;allow-other-keys =&gt; &lt;нет значений&gt;</dt><dd>


<p>
Функция сбрасывает и перенастраивает <a href="#целевое==устройство">целевое устройство</a> содержащее ядро CORE (по умолчанию выбирается являющееся активным в данный момент), 
с учётом ключевых аргументов PLATFORM-ARGS.
Производятся следующие действия:
</p><ul>
<li>
осуществляется попытка выяснить текущие значения делителей частоты;
</li>
<li>
кристалл сбрасывается в первоначальное состояние;
</li>
<li>
системные компоненты перенастраиваются с использованием либо сохранённых значений делителей частоты,
либо значений по умолчанию для данной платформы.
</li>
<li>
устанавливается соответствующая текущим настройкам глубина режима отладки (по умолчанию &ndash; :DEBUG).

</li>
</ul>
</dd>
</dl>

</div>

<div id="outline-container-7.1.2.1" class="outline-5">
<h5 id="sec-7.1.2.1"><span class="section-number-5">7.1.2.1</span> Определение текущего значения делителя частоты кристалла. </h5>
<div class="outline-text-5" id="text-7.1.2.1">

<dl>
<dt>platform-core-frequency-multiplier platform system core =&gt; &lt;целое число&gt;</dt><dd>


</dd>
</dl>
</div>

</div>

<div id="outline-container-7.1.2.2" class="outline-5">
<h5 id="sec-7.1.2.2"><span class="section-number-5">7.1.2.2</span> Сброс кристалла в первоначальное состояние </h5>
<div class="outline-text-5" id="text-7.1.2.2">

<dl>
<dt>reset-target-platform (o target) (p platform) &amp;rest platform-args &amp;key stop-cores-p &amp;allow-other-keys =&gt; &lt;нет значений&gt;</dt><dd>


<p>
Данная функция опирается на нижеследующие:
</p>
</dd>
</dl>
<ul>
<li id="sec-7.1.2.2.1">Сброс целевого устройства стредствами TAP <br/>
<dl>
<dt>interface-reset-target (o parport-interface) stop-cores-p</dt><dd>

</dd>
<dt>interface-reset-target (o ezusb-interface) stop-cores-p</dt><dd>


<p>
Средствами адаптера осуществляется аппаратный сброс целевого устройства, после чего выполняются
команды TAP DEBUG REQUEST и DEBUG ENABLE.
</p>
</dd>
</dl>
</li>
<li id="sec-7.1.2.2.2">Инициализация состояния RISC-ядер <br/>
<dl>
<dt>reset-core (core mips-core)</dt><dd>


<p>
Эта функция убирает все активные точки останова и сбрасывает все ведомые ядра (т.е. DSP).
</p>
</dd>
</dl>
</li>
<li id="sec-7.1.2.2.3">Настройка системных компонентов платформы целевого устройства <br/>
Эта функция была описана выше, см. <a href="#sec-7.1.1.4.3">Настройка системных компонентов платформы целевого устройства</a>.

</li>
</ul>
</div>

</div>

<div id="outline-container-7.1.2.3" class="outline-5">
<h5 id="sec-7.1.2.3"><span class="section-number-5">7.1.2.3</span> Установка глубины режима отладки </h5>
<div class="outline-text-5" id="text-7.1.2.3">

<dl>
<dt>(setf state) new-state core &amp;rest transition-args</dt><dd>


<p>
Управление состоянием отладки ядра CORE.
</p>
<p>
<a href="#Параметр">Параметр</a> NEW-STATE может принимать одно из следующих состояний:
</p><ul>
<li>
:DEBUG, для глубокого, инвазивного режима отладки, с полностью доступным функционалом отладчика;
</li>
<li>
:STOP, для режима минимального вмешательства;
</li>
<li>
:FREE, запуск ядра.

</li>
</ul>
</dd>
</dl>
</div>
</div>
</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Существенные недостатки </h2>
<div class="outline-text-2" id="text-8">

<ul>
<li>
отсутствие поддержки отладки DSP-ядер семейства кристаллов до NVCom;
</li>
<li>
отсутствие механизма автодополнения команд в интерактивном режиме в Windows,
и сколько-либо приемлимого механизма редактирования строки в Linux вообще<sup><a class="footref" name="fnr.6" href="#fn.6">6</a></sup>;
</li>
<li>
лишь частичная поддержка системы команд mdb;
</li>
<li>
отсутствие поддержки сценариев в формате mdb;
</li>
<li>
отсутствие механизма асинхронного запроса прерывания исполнения и выхода из режима отладки
на платформе Windows.
</li>
</ul>
</div>

</div>
