doc/comdb-notes-ru.org
* Словарь
  - <<<адаптер>>> ::
    Устройство посредством которого осуществляется сообщение между вычислительной системой разработчика и JTAG TAP на плате целевого устройства.
    Различаются адаптеры следующим образом: 1. по размещению -- встроенные на плате и внешние, 2. по стандарту обмена данных -- EPP и USB.
  - <<<ключевое слово>>> ::
    Символ из пакета KEYWORD.  Печатная форма символа префиксирована символом двоеточия.  Пример: :FOO.
  - <<<опциональный параметр>>> ::
    Параметр чей соответствующий позиционный аргумент необязателен.
    Если аргумент не задан используется значение по умолчанию.
  - <<<ключевой параметр>>> ::
    Параметр чей соответствующий ключевой аргумент необязателен (обязательные ключевые аргументы не существуют).
    Если аргумент не задан используется значение по умолчанию.
  - <<<ключевые слова лямбда-списка>>> ::
    Символы, чьи имена начинаются с амперсанда (символа '&') и распознаются в лямбда-списках специальным образом.
  - <<<обычный лямбда-список>>> ::
    Лямбда-список используемый для определения набора параметров функций и протокола их принятия ею в языке Common Lisp.
  - <<<остаточный параметр>>> ::
    Параметр, который был учреждён с помощью ключевого слова лямбда-списка &rest.
  - <<<символ>>> ::
    1. В контексте программы целевого устройства: идентификатор связанный при помощи таблицы символов с адресом.
    2. В контексте языка Common Lisp: объект типа символ, использующийся для именования различных сущностей.
  - <<<спецификатор адреса>>> ::
    Объект обозначающий адрес и являющийся одним из: символ (обозначающий адрес связанный с данным символом в активной таблице символов),
    или неотрицательное целое (обозначающее адрес).
  - <<<спецификатор аппаратной точки останова>>> ::
    Объект обозначающий аппаратную точку останова и являющийся одним из: неотрицательное целое (обозначающий аппаратную точку останова
    с соответствующим номером), аппаратная точка останова (обозначающая саму себя).
  - <<<спецификатор программной точки останова>>> ::
    Объект обозначающий программную точку останова и являющийся одним из: неотрицательное целое (обозначающий программную точку
    останова установленную на соответствующий адрес), программная точка останова (обозначающая саму себя).
  - <<<спецификатор DSP-ядра>>> ::
    Объект обозначающий DSP-ядро и являющийся одним из: неотрицательное целое (обозначающее соответствующее DSP-ядро активного целевого
    устройства), DSP-ядро (обозначающее само себя).
  - <<<целевое устройство>>> ::
    Аппаратный компонент предмета отладки.
* Footnotes

[fn:1] Почти. В данном контексте пользователь вряд ли столкнётся с
[[http://www.lispworks.com/documentation/HyperSpec/Body/02_b.htm#multiple_escape][пунктом 6 статьи 2.2 спецификации ANSI Common Lisp]].

[fn:2] На данный момент.  Возможна реализация специального, строчно-
ориентированного режима интерпретации файлов с расширением ".cmd",
специально для удобства взаимодействия с имеющейся базой скриптов
написанных для отладчика MDB.

[fn:3] Другими словами, значение переменной =*READ-BASE*= во время
чтения параметров командной строки равно #x10.

[fn:4] На самом деле обычные лямбда-списки в Common Lisp определяют
ещё и ключевое слово &aux, но в данном контексте он не существенен.

[fn:5] Опущено ключевое слово &aux, спецификатор указанности необязательных
аргументов supplied-p и механизм переименовывания.
См. главу 3.4.1 спецификации Common Lisp:
 http://www.lispworks.com/documentation/HyperSpec/Body/03_da.htm

[fn:6] Ввиду наличия в Linux программы rlwrap, прозрачно добавляющей отличный механизм
редактирования строки и достаточно приемлимый механизм автодополнения, на этой платформе
эта проблема стоит не так остро.  Впрочем, в Windows командная оболочка предоставляет
консольным приложениям сервис редактирования строки, так что и там дела обстоят не совсем
плохо.
