doc/comdb-notes-ru.html

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Словарь </h2>
<div class="outline-text-2" id="text-9">

<dl>
<dt><a name="адаптер" class="target">адаптер</a></dt><dd>

<p>
Устройство посредством которого осуществляется сообщение между вычислительной системой разработчика и JTAG TAP на плате целевого устройства.
Различаются адаптеры следующим образом: 1. по размещению &ndash; встроенные на плате и внешние, 2. по стандарту обмена данных &ndash; EPP и USB.
</p></dd>
<dt><a name="ключевое==слово" class="target">ключевое слово</a></dt><dd>

<p>
<a href="#Символ">Символ</a> из пакета KEYWORD.  Печатная форма символа префиксирована символом двоеточия.  Пример: :FOO.
</p></dd>
<dt>@&lt;a name="опциональный==<a href="#параметр">параметр</a>" class="target"&gt;опциональный <a href="#параметр">параметр</a></a></dt><dd>

<p>
<a href="#Параметр">Параметр</a> чей соответствующий позиционный <a href="#аргумент">аргумент</a> необязателен.
Если <a href="#аргумент">аргумент</a> не задан используется значение по умолчанию.
</p></dd>
<dt>@&lt;a name="ключевой==<a href="#параметр">параметр</a>" class="target"&gt;ключевой <a href="#параметр">параметр</a></a></dt><dd>

<p>
<a href="#Параметр">Параметр</a> чей соответствующий ключевой <a href="#аргумент">аргумент</a> необязателен (обязательные ключевые аргументы не существуют).
Если <a href="#аргумент">аргумент</a> не задан используется значение по умолчанию.
</p></dd>
<dt><a name="ключевые==слова==лямбда-списка" class="target">ключевые слова лямбда-списка</a></dt><dd>

<p>
Символы, чьи имена начинаются с амперсанда (символа '&amp;') и распознаются в лямбда-списках специальным образом.
</p></dd>
<dt>@&lt;a name="обычный==<a href="#лямбда-список">лямбда-список</a>" class="target"&gt;обычный <a href="#лямбда-список">лямбда-список</a></a></dt><dd>

<p>
<a href="#Лямбда-список">Лямбда-список</a> используемый для определения набора параметров функций и протокола их принятия ею в языке Common Lisp.
</p></dd>
<dt>@&lt;a name="остаточный==<a href="#параметр">параметр</a>" class="target"&gt;остаточный <a href="#параметр">параметр</a></a></dt><dd>

<p>
<a href="#Параметр">Параметр</a>, который был учреждён с помощью ключевого слова лямбда-списка &amp;rest.
</p></dd>
<dt><a name="символ" class="target">символ</a></dt><dd>

<ol>
<li>
В контексте программы целевого устройства: идентификатор связанный при помощи таблицы символов с адресом.
</li>
<li>
В контексте языка Common Lisp: объект типа <a href="#символ">символ</a>, использующийся для именования различных сущностей.
</li>
</ol>
</dd>
<dt><a name="спецификатор==адреса" class="target">спецификатор адреса</a></dt><dd>

<p>
Объект обозначающий адрес и являющийся одним из: <a href="#символ">символ</a> (обозначающий адрес связанный с данным символом в активной таблице символов),
или неотрицательное целое (обозначающее адрес).
</p></dd>
<dt><a name="спецификатор==аппаратной==точки==останова" class="target">спецификатор аппаратной точки останова</a></dt><dd>

<p>
Объект обозначающий аппаратную точку останова и являющийся одним из: неотрицательное целое (обозначающий аппаратную точку останова
с соответствующим номером), аппаратная точка останова (обозначающая саму себя).
</p></dd>
<dt><a name="спецификатор==программной==точки==останова" class="target">спецификатор программной точки останова</a></dt><dd>

<p>
Объект обозначающий программную точку останова и являющийся одним из: неотрицательное целое (обозначающий программную точку
останова установленную на соответствующий адрес), программная точка останова (обозначающая саму себя).
</p></dd>
<dt><a name="спецификатор==DSP-ядра" class="target">спецификатор DSP-ядра</a></dt><dd>

<p>
Объект обозначающий DSP-ядро и являющийся одним из: неотрицательное целое (обозначающее соответствующее DSP-ядро активного целевого
устройства), DSP-ядро (обозначающее само себя).
</p></dd>
<dt><a name="целевое==устройство" class="target">целевое устройство</a></dt><dd>

<p>
Аппаратный компонент предмета отладки.
</p>

</dd>
</dl>







</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> Почти. В данном контексте пользователь вряд ли столкнётся с
<a href="http://www.lispworks.com/documentation/HyperSpec/Body/02_b.htm#multiple_escape">пунктом 6 статьи 2.2 спецификации ANSI Common Lisp</a>.
</p>
<p class="footnote"><sup><a class="footnum" name="fn.2" href="#fnr.2">2</a></sup> На данный момент.  Возможна реализация специального, строчно-
ориентированного режима интерпретации файлов с расширением ".cmd",
специально для удобства взаимодействия с имеющейся базой скриптов
написанных для отладчика MDB.
</p>
<p class="footnote"><sup><a class="footnum" name="fn.3" href="#fnr.3">3</a></sup> Другими словами, значение переменной <code>*READ-BASE*</code> во время
чтения параметров командной строки равно #x10.
</p>
<p class="footnote"><sup><a class="footnum" name="fn.4" href="#fnr.4">4</a></sup> На самом деле обычные лямбда-списки в Common Lisp определяют
ещё и <a href="#ключевое==слово">ключевое слово</a> &amp;aux, но в данном контексте он не существенен.
</p>
<p class="footnote"><sup><a class="footnum" name="fn.5" href="#fnr.5">5</a></sup> Опущено <a href="#ключевое==слово">ключевое слово</a> &amp;aux, спецификатор указанности необязательных
аргументов supplied-p и механизм переименовывания.
См. главу 3.4.1 спецификации Common Lisp:
<a href="http://www.lispworks.com/documentation/HyperSpec/Body/03_da.htm">http://www.lispworks.com/documentation/HyperSpec/Body/03<sub>da</sub>.htm</a>
</p>
<p class="footnote"><sup><a class="footnum" name="fn.6" href="#fnr.6">6</a></sup> Ввиду наличия в Linux программы rlwrap, прозрачно добавляющей отличный механизм
редактирования строки и достаточно приемлимый механизм автодополнения, на этой платформе
эта проблема стоит не так остро.  Впрочем, в Windows командная оболочка предоставляет
консольным приложениям сервис редактирования строки, так что и там дела обстоят не совсем
плохо.
</p>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Serge Kosyrev
<a href="mailto:_deepfire@feelingofgreen.ru">&lt;_deepfire@feelingofgreen.ru&gt;</a>
</p>
<p class="date"> Date: 2010-01-11 19:31:36 MSK</p>
<p class="creator">HTML generated by org-mode 6.27a in emacs 23</p>
</div>
</div>
</body>
</html>
